[
 {
  "job_id": "2613863573",
  "title": "Content Specialist",
  "company": "Duolingo",
  "place": "New York, NY",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/content-specialist-at-duolingo-2613863573?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=d3w4NPeCHmqWBqnw3dWnnA%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "A marketing-savvy editor and content strategist who can get the world excited about learning.Our mission at Duolingo is to develop the best education in the world and make it universally available. With over 500 millions users, we are the most popular language learning application in the world. But we’ve got more work to do — and that’s where you come in!This role will assume ownership over our blog and our in-app news feed. We are looking for a content marketer with strong writing skills, or an experienced editor with a background in content strategy. A seasoned journalist who can think like a marketer could thrive in this role.Our blog helps tell the world about the amazing research and development that go into making Duolingo, it helps get our learners and fans excited about new features and courses, or it can help share our company culture with new grads and job seekers. Our in-app news feed is a powerful marketing channel to help inform our learners about product & company news.This role is part of the Global Communications group within the Marketing team, and would be the first Content Specialist position. We are looking for someone who can take ownership of the Duolingo blog and produce impactful content while ensuring high quality standards. You will work closely with the PR & Social Media team, but also have to interface with teams across the entire company to know what’s going on and help make sure we’re writing about it.You will... Be responsible for the content strategy of the Duolingo blog and Duolingo’s in-app news feed Ensure your content strategy aligns with & contributes to Company objectives Set & meet growth targets for each channel you own Plan the content calendars for each channel you own Act as editor of the Duolingo blog and develop and assign writing tasks to Duolingo staff Act as editor of the Duolingo in-app news feed and provide weekly content updates Write, edit and publish content on Duolingo’s blog Track content performance and provide reporting to the Marketing team Create & manage content style guides Conduct keyword & SEO research Own overall Duolingo blog & in-app news feed roadmaps and make long-term decisions around their features and development Become an internal “know-it-all” and know what’s going on across teams and departments, while externally keeping a pulse on what Duolingo’s global learners and fans care about most. You have... Minimum of 5 years of experience as a Content Strategist, Content Manager, Editor, or similar role A portfolio of published work in a relevant field or industry Knowledge of Content Management Systems, like WordPress, Ghost, etc. Exceptional written and verbal communication skills Ability to work with Designers and provide a brief Excellent writing & editing skills in English Basic understanding of HTML & web publishing Familiarity with SEO guidelines and keyword research tools Ability to work with Google Analytics and Google Suite products (Docs, Sheets, Slides) to track, organize and share data on key metrics. Ability to travel to Duolingo's Pittsburgh, PA headquarters every quarter Exceptional candidates will have... A strong personal interest in language learning and proficiency in more than one language A strong alignment with Duolingo’s mission and a passion for education Deep familiarity with Duolingo’s products",
  "job_function": "Marketing, Public Relations, and Writing/Editing",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Computer Software, and Internet"
 },
 {
  "job_id": "2613757348",
  "title": "Associate Brand Manager",
  "company": "Stella & Chewy's",
  "place": "Oak Creek, WI",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/associate-brand-manager-at-stella-chewy-s-2613757348?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=DEbb0QZZ%2B4WL48lW2y55%2FA%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "DescriptionStella & Chewy’s, one of the fastest growing premium pet food companies in the U.S., is looking for an Associate Brand Manager. This person will be critical in helping form a new Brand Management team. You will work in strong collaboration with the broader Marketing team to deliver brand objectives and lead a rapidly growing, highly dynamic business. The ideal candidate is a consumer-centric, insights- and data-driven marketer to help shape an already successful brand in the rapidly growing pet food industry.Reporting to the Senior Brand Manager, this role will play an essential role in helping analyze, develop, and implement annual marketing plans. The ABM will have a deep understanding of our consumer’s needs to drive relevancy and loyalty. The right individual will have a collaborative and confident working style and enthusiasm for making connections with co-workers, external partners, and consumers.Brand Management Contribute to and support comprehensive, short, and long-term strategic plans of the brand strategy. Executes day-to-day responsibilities against business priorities that best align with the strategy.Conduct in-depth analysis to identify opportunities, trends, and recommendations about the brand, competition, category, customer, and consumer to incorporate into the brand planning process.Strong experience in using syndicated data sources such as Nielsen to enable analysis of industry data.Lead and coordinate with legal counsel on key matters such as trademark, copyright, etc. Manage overall marketing team budget; forecast spending, monitor progress of plans, and adjust as needed to meeting timing and budget requirements. Track and report on marketing effectiveness and develop insights and actions to adjust plans to increase ROI.Marketing Communication PlansCoordinate the execution of sponsorships and award applications.Manage the product placement program, including assessment of relevant brand opportunities and providing brand assets for implementation. Assist the industry trade publication media and editorial opportunities to drive awareness and credibility with retailers.Team LeadershipEmbody a spirit of ownership, motivate, and cooperate within an entrepreneurial culture that celebrates a willingness to do what it takes to support the team.Communicate and operate broadly across the organization’s departments, including Innovation, Sales, Marketing, Operations and Finance.Requirements 2+ years of experience in a brand management, Consumer Packaged Goods required. Experience in Pet Food industry a plus. Bachelor’s Degree in Marketing required, with MBA or Master’s in Marketing preferred.Thrives in a fast-paced environment with the ability to shift priorities to meet rapidly evolving business needs.Resilient and creative problem-solver who demonstrates curiosity and strives for constant improvement in ambiguous settings.Significant analytical and critical thinking skills with experience analyzing data and telling stories with data.Strong experience using syndicated data sources (i.e. Nielsen, IRI).Strong attention to detail.Strong written and verbal communication and presentation skills.A strong sense of ownership and personal accountability.High level of independence and resourcefulness.A passion for pets; must be comfortable with dogs and cats.Willingness to travel to conduct market visits, attend trade shows, and support key meetings. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status, or any other status protected by law.",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Information Technology and Services, Computer Software, and Consumer Goods"
 },
 {
  "job_id": "2613788444",
  "title": "Marketing Coordinator",
  "company": "Artisanal Brewing Ventures",
  "place": "Charlotte, NC",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/marketing-coordinator-at-artisanal-brewing-ventures-2613788444?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=%2FUA%2F9Hn7bCcuMM%2Bh8qHcVQ%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Marketing CoordinatorPosition SummaryThe Marketing Coordinator is responsible for assisting the brand teams in implementing key marketing programming and brand deliverables via social content and brand marketing support.Key Responsibilities Assisting in the creation of monthly brand social calendars across platforms to bring brand persona to life and support marketing calendar. Execution and scheduling of monthly content, including plans to capture message/targeting testing. Data collection and monthly reporting for campaigns and social efforts. Assistance in creating sales materials and program support tools Program and media execution support such as sampling distribution, consumer surprise and delight fulfillment and other needs. Consumer engagement and monitoring across social pages. Additional support to analyze effectiveness of consumer programs utilizing internal and external data and partnering with ABM to make recommendations to modify elements or changes in strategic direction. Perform other business-related duties as assigned. Key Competencies People Agility - Uses a high interpersonal effectiveness and effective written and verbal communication, along with a consistent and positive energy, to gain trust and support across the team.Agile Learning - A curious learner who quickly assesses complex problems, seeing the big picture and adapting past experiences to new situations, to create opportunities and overcome challenges.Motivation & Tenacity - Self-starter who knows how to prioritize multiple projects to get things done at a high level.Results Orientation - Displays drive and initiative and focused on delivering the desired outcomes, but getting there through teamwork, collaboration, and aligning to ABV values.Collaborate - Works cooperatively with others across the organization to achieve shared objectives. Represents own interests while being fair to others and other areas. Partners with other to get work done. Credits others for their contributions and accomplishments. Gains trust and support of others.Position Requirements Bachelor’s degree or some College preferred Approximately 1 year of related/relevant experience required Proficient in Excel & PowerPoint Highly proficient as a social media user Design, photography, and/or copywriting experience is preferred Beer/Adult Beverage experience is not a requirement DisclaimerThis Job Description is only a summary of the typical functions of the job, not an exhaustive or comprehensive list of all possible job responsibilities, tasks and duties.Artisanal Brewing Ventures is an Equal Opportunity Employer",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Food & Beverages, Food Production, and Consumer Goods"
 },
 {
  "job_id": "2613831565",
  "title": "Student / Intern",
  "company": "Oracle",
  "place": "California, United States",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/student-intern-at-oracle-2613831565?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=pLIqU%2B2TkJysMYDh61xP%2Fg%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job DescriptionOracle has a unique opportunity for a current college student to do an 2021 summer internship with the North America Talent Advisory team! Our team is responsible for all professional recruiting across Oracle in North America. As an intern, you will be part of the sourcing team and working alongside the sourcing team to learn more about talent acqusition and HR. You will be given requsitions to source and aligned to businesses much like a regular sourcer, but don't worry - we will provide you with training, mentorship, guidance and support as you learn the ropes. Additionally, you will also have a strategic project that you will be working with during the summer along with presentations at the end of the summer. This is a 12 week internship and will be done remotely.Successful sourcers (recruiting research associates) at Oracle will be able to build strategies to identify and attract top talent, partner with clients and talent sourcers to ensure a positive candidate experience and have a deep understanding of the talent market and candidate profiles.Responsibilities Work with Talent Advisors, hiring managers, and other stakeholders to understand recruiting needs and candidate profiles. Create and execute sourcing strategies to identify quality candidates at scale. Focused on delivering a positive and transparent candidate experience. Understand the competitive ecosystem and talent profiles and be able to adjust and creatively source the talent for Oracle Detailed Description And Job RequirementsThe Research Associate is involved throughout the entire value chain of the search process, working in conjunction with recruiters throughout the kick-off, strategy, and execution of search engagements to bring each search to a successful completion.Identify high quality and potential candidates for senior level assignments. Partner and collaborate with executive recruiter. Build intellectual capital and keep up-to-date with key market trends and competitive intelligence. Assist other team members in research and candidate identification of relevant profiles. Support team members in mapping of competitors. Maintain and update internal database while understanding the importance of data integrity. Partner with team member to develop target company lists through market research. Utilize existing tools, resources and technologies to assist in identifying top talentRequired Qualifications Must be a current college student with a graduation date after August 2021 and before May 2023 (Junior or Senior) Must be attending college in the United States, pursuing a BA/BS or a graduate degree. Must be able to complete a 12 week internship Preferred Qualifications Pursuing an HR degree or certification Motivated by an intellectually stimulating recruitment environment with the desire to identify the best talent for Oracle. High self-motivation and the ability to work both autonomously and as part of a team. Excellent communication and organization skills. Intellectually curious and highly analytical individua 10.1.0This job code is utilized for the majority of our temporary hires. The individual is performing hourly job duties as defined under the Fair Labor Standards Act.If you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 105135 in the subject line of the email.About UsInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
  "job_function": "Education and Training",
  "employment_type": "Internship",
  "industries": "Information Technology and Services, Computer Software, and Financial Services"
 },
 {
  "job_id": "2613816832",
  "title": "Research Associate",
  "company": "Harvard University",
  "place": "Boston, MA",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/research-associate-at-harvard-university-2613816832?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=CBYDoPdsfheHhoi0ceHWUg%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job-Specific ResponsibilitiesThe Harvard Business School seeks a Research Associate to assist in delivering the first year MBA course, The Entrepreneurial Manager (TEM). The course is well-liked by students and is taught by a group of dedicated faculty who bring a range of academic and professional experiences to the topic of entrepreneurship. The course invites 900+ students to learn how to lead amidst extreme uncertainties. A curious and talented RA will help make TEM even more effective with students at a time of great opportunity and looming questions for entrepreneurs in the U.S. and around the world.The RA will engage with the course faculty on course development, content creation, and execution. This work will cover a range of core subjects, including: the design and development of new business models; financing entrepreneurial ventures; the hiring and management of people at early stage ventures, and scaling startup firms.These Include, In Partnership With The Faculty Teaching GroupThe RA will collaborate on several activities to support the delivery of a highly successful case-based course.Writing and updating Harvard Business School cases on entrepreneurial ventures, which serve as the centerpiece of the course;Creating teaching notes and other teaching materials related to these cases, drawing on key lessons from these episodes and core findings in the academic literature;Synthesizing key concepts from scholarship in economics, sociology, history, and other disciplines that touch on entrepreneurship in ways that make them accessible to a wide range of students;Developing quantitative exercises, primarily based in Excel, to help students learn the tools and techniques of entrepreneurial finance and of measuring and monitoring inside new firms;Researching and sharing timely developments in entrepreneurship that may shed new insight into individual cases or the course as a whole; andPreparing and assessing assignments, exams, and other course tools.Other duties as assigned.They RA may provide tutorial support to students outside the classroom.The RA will attend all faculty teaching-group meetings.Ideal candidates will be comfortable in an environment that requires an exacting level of quality and intellectual rigor. They will enjoy collaborating with HBS faculty. They will be keenly interested in the topic of entrepreneurship; they may bring outside experience or academic interest to the subject. They will believe in the potential that outstanding teaching brings to a course and the partnership that engaged students and dedicated teachers share in the classroom.Basic QualificationsAdvanced degree or bachelor’s degree with significant years of relevant work experience.MBA, MS in Finance, or Ph.D. level work can be helpful.Additional Qualifications And SkillsEvidence of academic excellence and careful, skillful writing is required. 2-4 years of relevant work experience is desired. The successful candidate must have a strong quantitative background and experience creating or extensive experience using technical tools such that they could develop them for others; have solid financial, analytical, conceptual skills; work well independently; and be at home in an academic environment. Excellent communication, interpersonal, organization, research, writing, and editing skills are required. Successful candidates will demonstrate a proven ability to handle multiple projects simultaneously and to flexibly adapt to changes in priorities; to work calmly under deadline pressure; to work both independently and as a team member; to take initiative; and to follow projects through to completion. All positions will be given a writing exam. The ability to read academic, subject-specific information and write a reasoned and thoughtful analysis or produce a synthesized interpretation, is necessary. Diplomacy, integrity, and judgement are a must.Additional InformationThis is a half-time appointment starting this summer (start date flexible) through June 30, 2022 with potential for reappointment. All HBS RA roles are structured as one-year term appointments with potential for renewal.Applications will be considered on a rolling basis, a cover letter and resume are required for full consideration. Upon the review of application materials, applicants may be asked to submit a writing sample, and transcript(s). All positions will be given a writing exam.Harvard Business School does not offer visa sponsorship for this opportunity.While we continue to monitor the evolving COVID-19 guidelines and restrictions, we appreciate your understanding and flexibility with our interview process. Please note that we will be conducting interviews virtually (phone and or Zoom) for selected candidates until further notice.Culture of Inclusion: The work and well-being of HBS is profoundly strengthened by the diversity of our network and our differences in background, culture, national origin, religion, sexual orientation, and life experiences. Explore HBS work culture.Job FunctionResearchLocationUSA - MA - BostonJob CodeRS0056 Researcher II HumanitiesSub-UnitDepartmentDivision of Research and Faculty DevelopmentTime StatusPart-time Salary Grade 056Union00 - Non Union, Exempt or TemporaryAppointment End Date30-Jun-2022Pre-Employment ScreeningEducation, IdentityEEO StatementWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, gender identity, sexual orientation, pregnancy and pregnancy-related conditions, or any other characteristic protected by law.",
  "job_function": "Research, Analyst, and Information Technology",
  "employment_type": "Part-time",
  "industries": "Nonprofit Organization Management, Financial Services, and Hospital & Health Care"
 },
 {
  "job_id": "2613817628",
  "title": "Operations Associate",
  "company": "Bird",
  "place": "Santa Monica, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/operations-associate-at-bird-2613817628?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=SFW1kRsEUOS34PG%2F5QoqBA%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Who Is BirdBird is a global team guided by a shared vision: to make cities more livable through safe, sustainable electric mobility. From our first e-scooter ride in 2017 to the thousands of rides taking place every day, our passionate team and award winning custom vehicles have helped riders complete hundreds of millions of carbon-free trips in more than 150 cities around the world. And we're just getting started.Bird’s Community Operations team facilitates operational excellence by providing customers world-class experiences, providing critical insights to cross-functional stakeholders, and driving strategic and new initiatives forward. The team stays focused on aligning the highest-level company priorities with effective day-to-day operations, and helping identify and evolve early market signs into future strategic initiatives.The team is seeking a highly-driven, team-oriented, and analytical associate with a bias toward action and impact. The role will oversee BPO sites’ operations covering multiple languages and countries. This role will ensure consistent delivery of key performance metrics related to production, quality (CSAT), and required service level agreements (SLAs). This is a highly cross-functional opportunity to work with city operations, product, systems and business analytics teams to strengthen standard operating procedures, ongoing training, schedules, and staffing.ResponsibilitiesBuild and implement operational processes that deliver scalable solutionsAnalyze key business drivers, trends, and operational metrics to inform improvement strategy and project designMonitoring vendor performance across relevant KPIs and conduct deep-dive investigations to understand the “why” behind how metrics are performingLeverage business tools such Zendesk and/or technical add-ons to identify and remove performance barriersEnsure BPO and contractor agent teams are executing operational strategies to assure compliance with SLAs across all supported lines of businessLead daily and weekly performance reviews and communication with BPO/Contractor teams Work with senior leadership to align staff schedules with defined strategiesWork with Business Analytics team to further create and define key performance indicators (KPI’s) and methodologies to improve and maintain customer experiencePresent analyses and lead discussion with cross-functional stakeholders to senior leadershipRequirementsBA/BS in Business or other related major or equivalent relevant work experience required3+ years experience outsourcing strategy and implementation. Ideally experience in managing and coaching BPO and contractor agent teamsStrong communication, organization and stakeholder management skillsExcel modeling skills and PowerPoint presentation skillsAble to work across cultures effectively, valuing diversity within a virtual teamWilling and eager to roll up sleeves and get to know the business detail-orientedPreferred QualificationDemonstrated ability to deliver results in a fast-paced environmentExperience in the media, digital and/or tech industriesExperience with Zendesk and SQLBilingual or Multilingual is a plusGrowth mindset: seek out learning opportunities for yourself and the teamCulture at BirdWe're an ambitious, smart and open-minded team that is passionate about our mission. Each day is unlike the last, as we’re constantly moving forward, challenging each other, and working together to create the future of micro-mobility.Perks upWe want people to succeed at Bird, so we give our teams plenty of time off to relax and recharge. We also offer a generous employer-paid healthcare coverage, on-demand doctor visits, childcare support, a pre-tax commuter account for mass transit or parking, a wellness stipend, and more.Bird is the worldBird stands for a culture of inclusion. We celebrate different backgrounds, experiences, and perspectives —encouraging everyone to bring their authentic selves to work. We have a diverse environment that empowers our team to feel comfortable when they voice their opinions. For these reasons and more Bird is a proud equal employment opportunity employer. We welcome everyone regardless of their race, color, religion, sex, national origin, age, disability, veteran status, or genetics, and we are dedicated to providing an inclusive, open, and diverse work environment.Sound like a place you’d like to work? Sweet. Let’s chat.",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Computer Software, Internet, and Financial Services"
 },
 {
  "job_id": "2613796909",
  "title": "Creative Content Writer",
  "company": "Lowcountry Land Trust",
  "place": "Charleston, SC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/creative-content-writer-at-lowcountry-land-trust-2613796909?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=H5wkowxb%2Be0MIrXEylw%2BaQ%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Position: Creative Content WriterPosition Type: Full-timeReporting: Chief Advancement OfficerLocation: Charleston, SC (Remote from Home) Application Instructions:To apply, please email a cover letter and resume in one PDF to:Kate Durand, Communications Managerkdurand@lowcountrylandtrust.org POSITION SUMMARYLowcountry Land Trust (“LLT”) seeks a Creative Content Writer (“CCW”) who will perform basic communications tasks that the LLT Advancement Team needs to execute our editorial calendar and overall communications and fundraising strategy. The CCW is an individual who is highly skilled at developing dynamic and compelling narratives that inspire and engage audiences across various media. These stories will drive the content of our website, social media, printed materials, and grant proposals, and will embody the voice of the organization through the written word. Reporting to the Chief Advancement Officer, the CCW will compose content according to the editorial and fundraising calendars developed by the Communications Manager and Chief Advancement Officer, and is an integral member of the Advancement Team. This is an entry-level position, and we encourage applicants who are ready to learn and hone their skills. RESPONSIBILITIES Communications Writing:Serve as the in-house copywriter, assisting and collaborating to create content in adherence to LLT’s editorial calendar, overarching themes, branding, and strategy.Draft and post social media content on LLT’s established social channels with the opportunity to assist in expanding to new channels.Assist in the assembly of our monthly newsletter (writing/editing support where needed, uploading blog posts, building the email newsletter template). Assist in procuring content to build out new series/ programs as they are strategized.Create and/or collaborate on the development of written communications, including social media and blog posts, press releases, newsletters, fundraising appeals, and other marketing copy.Grant Coordination:Prepare proposals by determining concept, gathering and formatting information, writing drafts, and obtaining approvals.Meet proposal deadlines by establishing priorities and target dates for information gathering, writing, review, approval, and transmittal.Develops proposal by assembling information including project nature, objectives/outcomes/deliverables, implementation, methods, timetable, staffing, budget, standards of performance, and evaluation.Writes, revises, and edits drafts including executive summaries, conclusions, and organization credentials.Maintains quality results by using templates; following proposal-writing standards including readability, consistency, and tone; maintaining proposal support database (Raiser’s Edge).Updates job knowledge by participating in educational opportunities; maintaining personal networks. QUALIFICATIONSRequired:Bachelor’s degree in Communications, Marketing, Design, Journalism, Creative Writing, English, or a related field from an accredited institution of higher education. 0-4 years of experience (entry level).Must have excellent written and verbal communication skills.Excellent leadership, collaboration, time management, organizational, communication, and interpersonal skills.Proficiency in organizing and prioritizing tasks in a fast-paced environment.Demonstrated capacity to develop narratives based on prompts or concepts.Passion for conservation and the Lowcountry.Ability and confidence to learn and adapt.Preferred:Familiarity with G Suite and Microsoft Office.Experience with Canva, InDesign and Photoshop.Experience with content management systems.Familiarity with project management software (Monday.com) and donor database (Raiser’s Edge).Familiarity with video development and simple editing software.REMOTE WORK REQUIREMENTSPhone (mobile or landline)Reliable internet Printer (if needed)LLT will provide the following:Laptop, mouse, keyboard, monitor Desk and chair (if needed)Office supplies (paper, pens, organizers, stapler, etc.)BENEFITSInsuranceHealth Insurance - 100% Employer Paid for EmployeeDental Insurance – 100% Employer Paid for EmployeeLife Insurance ($10,000)Long Term DisabilityFinancial & Retirement403(b) – 5% Match and Fully VestedFamily & ParentingMaternity & Paternity LeaveRemote Work/Work from Home Day(s)Flexible HoursPaid Time OffUnlimited vacation and sick days11 Paid Holidays Flexible Summer Schedule Perks Dog Friendly WorkplaceMobile Phone Reimbursement ($20 per month)Health & Wellness Positive EnvironmentLowcountry Land Trust is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613749603",
  "title": "Content Writer",
  "company": "Jerry",
  "place": "New York, United States",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/content-writer-at-jerry-2613749603?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=HjeLIUZ8uTZph5HdjNpy9w%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "We’d love to hear from you if you are looking for Start-up energy working with a brilliant and passionate team $300 billion market opportunity Exponential growth (10X revenue growth in 2020) Rockstar teammates. You will be working with a strong team with prior work experience at Facebook, Amazon, Microsoft, GEICO, Lending Club, SoFi, etc. About The RoleAs a writer on the Jerry team, you will research and write articles to help our readers make informed decisions about their personal finance and the management of their two most expensive assets, their car and their home. You will play a big role in scaling our organic content across our website, social media channels, ad networks, affiliates and partner sites to continue driving our audience reach and user growth. Working with our talented team of writers and editors, you will play a pivotal role in building and shaping the future of our story.Responsibilities Writing engaging and insightful editorial content that will delight our readers and help them make important decisions about their finances Researching and fact-checking highly sought-after topics across personal finance, insurance, and car and home-related subject matter Adhering to our brand guidelines across all digital media platforms Tracking and analyzing content performance to continue driving visibility across search and social channels Requirements Bachelor Degree in any discipline, preferably in a writing-intensive major (e.g. Journalism, Communications, English Literature, Media, History, Philosophy, Political Science, Sociology, Psychology, etc) Impeccable writing skills including the ability to harness style, tone and voice to appeal to your target audience Strong attention to detail; ability to conduct thorough and meticulous research Strong command of the written English language and an eye for how details can make a big impact Ability to juggle multiple competing deadlines without missing a beat About JerryJerry is building the first financial platform for your car that helps people optimize the cost and experience of owning a car (making ownership easy & affordable). There are 240M cars in the US alone. For most people, cars are one of the most expensive assets they own and families on average spend 20% of their income on car expenses, making this a massive market.We have started with helping people optimize the cost of car insurance and our vision is to help people in every aspect of car ownership. Since our product launch, we have been growing really fast for the past 18 months and our users love the product (rating 4.5 in the app store). Jerry is founded by serial entrepreneurs who previously built and scaled YourMechanic (“Uber for car repair,” the nation’s largest on-demand car repair company). We have raised over $50M+ in financing.",
  "job_function": "Marketing",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Internet, and Financial Services"
 },
 {
  "job_id": "2613850781",
  "title": "Online Marketing Specialist",
  "company": "Wish",
  "place": "San Francisco, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/online-marketing-specialist-at-wish-2613850781?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=xdxmVGV60%2BFButCDmVGt8Q%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Company DescriptionWish is a mobile e-commerce platform that flips traditional shopping on its head. We connect hundreds of millions of people with the widest selection of delightful, surprising, and—most importantly—affordable products delivered directly to their doors. Each day on Wish, millions of customers in more than 160 countries around the world discover new products. For our over 1 million merchant partners, anyone with a good idea and a mobile phone can instantly tap into a global market.We're fueled by creating unique products and experiences that give people access to a new type of commerce, where all are welcome. If you’ve been searching for a supportive environment to chase your curiosity and use data to investigate the questions that matter most to you, this is the place.Job DescriptionManage daily guest list for influencers to come onsiteConduct outreach and curate relationships with new influencersTrack social media trends & proactive pitching of opportunitiesPrepare weekly social media performance reporting and recaps for internal useFollowing up with influencers to ensure content guidelines are metWorking proactively to think about the guest experience (and any potential watchouts), as we roll new experiences, partnerships, and offerings (Getting ahead of questions and issues).Creative fun events around social campaigns and surprise & delight moments for guests.Manage social media accounts (posting stories, recap of events, announcements, etc).QualificationsExperience managing social media campaigns that incorporate live eventsHands on experience managing Influencer marketing campaignsKeen focus on company objectives and deliverablesAbility to maintain objectivity and discretion at all times even when interacting with high profile individualsSignificant live event experience including but not limited to large scale party planning and small event managementAbove all else, candidates must operate on behalf of our client company at all times and NOT try to leverage the company’s branding efforts to build their own brand.Additional InformationWish values diversity and is committed to creating an inclusive work environment. We provide equal employment opportunity for all applicants and employees. We do not discriminate based on any legally-protected class or characteristic. Employment decisions are made based on qualifications, merit, and business needs. If you need assistance or accommodation due to a disability, please let your recruiter know. For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records.Individuals applying for positions at Wish, including California residents, can see our privacy policy here.",
  "job_function": "Marketing",
  "employment_type": "Full-time",
  "industries": "Computer Software, Internet, and Consumer Goods"
 },
 {
  "job_id": "2613819719",
  "title": "Personal Executive Assistant",
  "company": "TalentBridge",
  "place": "Charlotte, NC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/personal-executive-assistant-at-talentbridge-2613819719?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=hzHCi5Bi8o0YdK5XfdYJ%2Bg%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job DescriptionWe are currently recruiting for an experienced personal assistant to support a sucessful business executive in the South Charlotte area. This role will require dedication to supporting him in his personal and professional life as we as ensuring the maintance of his homes in mutiple US locations.EXECUTIVE ADMINISTRATION Review CEO emails inbox and prepare daily document for review with ability to prioritize and track responses. Calendar management, preparation time/materials to review in advance Electronic files management and meeting follow-ups recorded and monitored Regular meeting tracking of group memberships, advisory boards, investor reporting, etc Corporate monthly expense report and submit wire transfer requests to Accounting PARTNER RELATIONSHIPS Notes dictated or transcribed after each meeting and provided before next meeting Google search for any recent major news Maintain database with new business cards and emails TRAVEL/EVENT COORDINATION National and international elite trip planning and experience including private jet charters, airport greeter service when applicable, communication to travel guests, dinner reservations and overall preferences Travel Membership tracking, coordination and renewals (AA Airpass, United PassPlus, Exclusive Resorts, Cuvee, Client Centurion Membership, Jetcard program hours, etc) Organize private events at the home (live music, food, wait-staff if not available, drinks, prep, etc) PERSONAL ASSISTANCE Personal accounting paying bills for private residence, vendors, contractors Prepare QuickBooks spending tracker report quarterly and merge with CFO personal accounting Personal Credit Cards monitored for unusual activity and paid in full accordingly Venmo and Zelle payments to vendors Medical appointments, labs and prescriptions with appropriate timing Submit out of pocket medical expenses to insurance Florida residency car registrations and track dates out of North Carolina state Personal errands and online ordering of supplies as needed Home Management/Auto Maintenance All vehicle, pool, lawn, home maintenance, water plants, fresh flowers - schedule, negotiate when necessary, manage and be present in the home when needed Hands-on role in Charlotte residence for minor repairs, organizing, attention to detail, manage vendors, etc Regular auto maintenance, gas, charged, cleaning, track registrations, ability to drive stick shift a plus&plus; Schedule and manage house cleaning and handyman as needed. Stock kitchen prior to client arrival and anticipate needs Charlotte residence wine cellar inventory entry and tracking whenever new items come in or consumed. Requirements College Degree Valid Driver's License Computer knowledge with Outlook, Word and Excel 5&plus; years of Administrative Assistant experience supporting senior level executives. 24/7 availability via phone/text/email, dedicated office hours Mon-Fri 8:30am-5:30pm and flexible evenings and weekends when needed. Ability to be onsite his SouthPark office when he is in town and private residence as needed. Can work remotely when he is traveling and check packages at both his home and office minimally twice a week when he is away Strong ability to work independently with little supervision; anticipate needs, attention to detail, proactive and organized Must be trust-worthy managing personal finances and confidentiality",
  "job_function": "Administrative",
  "employment_type": "Full-time",
  "industries": "Construction, Staffing and Recruiting, and Financial Services"
 },
 {
  "job_id": "2613783492",
  "title": "eCommerce Visual Merchandiser",
  "company": "Clarks",
  "place": "Waltham, MA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/ecommerce-visual-merchandiser-at-clarks-2613783492?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=YyjWW%2FfskPyNpXxw5UcPwA%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job Advert DescriptionClarks Americas is seeking an Online Visual Merchandiser to support a fast-growing channel within the organization. The Merchandiser will coordinate online merchandising activities for ClarksUSA.com, ClarksCanada.com and eBay. Additionally, this role will be responsible for, but not limited to, the following: product catalogue management, online administrative tasks and promotional management.Responsibilities Support online merchandising catalogue set up process, product categorization and product cross-sell and strategy. Work collaboratively with the performance marketing and merchandising teams to ensure appropriate marketing/product banners and content display is planned to maximize promotional plans. Analyse the customer path to purchase and recommend and implement changes that enhance the experience and increase online conversion. Maintain and report on advanced on-site search to deliver expected result, optimize experience and continually research and recommend new opportunities in the digital space. Responsible for executing support functions within the eCommerce platform, including but not limited to promotion set up, catalogue maintenance, gallery creation, site development, testing/validation Drive conversion and sales by ensuring latest product is showcased effectively on site and sales patterns shared with genders to influence future buy quantities. Review and analyse online competitor site merchandising, promotional execution and tactics, user experience, and product representation. Provide support to the development of additional marketplaces and a new website platform in the future.Skills, Knowledge & Experience BA/BS Degree in Marketing, Merchandising or related area Experience in eCommerce is preferred, not required Understanding of online trends, tactics and current footwear activity, as it relates to online/in-store Experience with 3rd party tools Strong knowledge of business admin tool and business processes/operations UX/UI or AB testing experience is a plus 1-3 years of Retail/eCommerce merchandising experience Demonstrated ability to work in a fast paced, self-starter environment Proven track record in a merchandising or merchandising function eCommerce platform exposure Project coordination experience Strong data analytical skills - must be able to assemble and interpret data, create summaries, and deliver business insights Ability to collaborate within a team and with cross-functional partners Proficient in MS Word, Excel, PowerPoint",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Staffing and Recruiting, Consumer Goods, and Retail"
 },
 {
  "job_id": "2613754103",
  "title": "Finance Intern",
  "company": "ProducePay",
  "place": "Los Angeles, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/finance-intern-at-producepay-2613754103?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=5gI8XD3siQmCghjiAwEzJA%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "ProducePay is a new tech-based cash flow solution that provides domestic and foreign fresh producefarmers (growers) who ship to the U.S. with immediate access to distribution and financing. ProducePay’ssolutions provide the working capital fresh-produce growers’ need to complete their harvest and grow.By leveraging our international network, ProducePay connects clients with interested fresh producebuyers and distributors. Interested distributors receive connection to a growing list of international farmersJob Descriptionwho might otherwise feel limited by current financing options. Assist with financial reports and client-related reports. Track contracts and assist with producing accurate and timely financial statements. Work with the engineering team on building out the platform. Other finance, Admin, and accounting tasks as needed. Processing and depositing check payments received, and perform document verification and credit exposure checks on a daily basis. Receiving, mailing, and handling legal documents. Requirements At least 3-month commitment (excellent candidates would be potentially promoted to full-time FinanceAnalyst) Extremely detail-oriented. Understanding of business and accounting concepts Advanced skills in Excel including pivot tables, macros, etc. Must be working towards (or have completed) a bachelor’s degree, preferably in Business, Economics, Mathematics or Accounting International students in STEM majors (3 years OPT) are accepted. Submit transcripts if graduated less than 2 years ago. Please include GPA on your resume. Benefits Medical and Life insurance (Covered 100% for Employee only) Dental and vision 401k – company contributes 3% (After 5 months of employment) Unlimited PTO $50 phone plans. 0.06% equity stock options Yearly bonus (eligibility varies) Work at the #1 ranked company in Los Angeles for best tech startup! Fully remote work through the end of COVID, 2 work from home days per week Friday Team Lunches Regular team outings (go-karting, paintball etc.) - Just ask for our team photos to see how much fun we’ve had ;)",
  "job_function": "Finance",
  "employment_type": "Contract",
  "industries": "Computer Software, Internet, and Financial Services"
 },
 {
  "job_id": "2613834424",
  "title": "Financial Analyst",
  "company": "MongoDB",
  "place": "New York, NY",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/financial-analyst-at-mongodb-2613834424?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=rp6wi0sWEYFtNIOoPLigtQ%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "The database market is massive (the IDC estimates it to be $119B+ by 2025!) and MongoDB is at the head of its disruption. The MongoDB community is transforming industries and empowering developers to build amazing apps that people use every day. We are the leading modern data platform and the first database provider to IPO in over 20 years. Join our team and be at the forefront of innovation and creativity.MongoDB is seeking a Financial Analyst to join the Financial Planning and Analysis (FP&A) team. This position requires an accomplished and analytical financial professional with a demonstrated track record of success in a dynamic, fast-paced environment.You are a successful business partner. You communicate clearly and are able to successfully juggle multiple priorities. You are a driven self-starter who is able to work with senior leadership comfortably, takes tasks from start to finish and someone who enjoys working in a fast-paced, challenging environment. You are responsive and adapt quickly to change, embrace challenges and champion the advancement of analyses, financial planning tools, systems, and controlsAs part of the FP&A team, your responsibilities will include Budget vs. Actual Opex analysis throughout the organization with appropriate commentary and understanding of notable variances Work closely with departments across the organization to understand changes in spend behavior in order to produce the most accurate Opex forecasts Assist in maintaining and enhancing our Adaptive Insights planning tool, with duties including updating headcount forecasts, developing new reports, training stakeholders, and reviewing our implementation to enhance forecasting accuracy and automation capabilities. Develop a deep understanding of the financial impact and ROI of investments made by the organization Identify cost efficiencies and assist our Procurement team with financial analytics to support vendor negotiations and spend forecasts. Analyze and validate variable expenses such as commissions, travel & expense, etc. Partner with the accounting team to ensure accuracy in departmental cost allocations that drive our quarterly external financial statements Assist in the annual budgeting process Assist in preparing quarterly board presentations Work on ad-hoc analysis and requests on a need basis About You 2+ years of relevant experience Strong analytical, critical thinking and quantitative skills Knowledge of corporate finance, financial statements, and basic accounting principles Ability to drive strategic direction through insightful analysis Ability to collaborate with different teams throughout the organization Flexibility (open to change) and ability to learn on the fly Drive for results & high sense of urgency Attention to detail Excellent oral and written communication skills Experience in Adaptive Insights or any other FP&A software tool is a big plus Experience with financial modeling and proficiency in Excel Demonstrated ability to roll-up your sleeves and work with team members, driving projects through to completion You are passionate about technology and problem solving What does success look like? ResponsibilitiesThe financial analyst, FP&A will be successful in this role when they can start executing the following strategic tasks/responsibilities after their first quarter with the company Develop a strong understanding of the key spend categories within the different departments across the organization and their budget vs actuals variances Learn to navigate around our ERP and FP&A systems (Netsuite, Adaptive and Concur) Identify initial areas for improvement within our opex forecasting and Adaptive Insights automation capabilities Provide proactive analytical support and establish strong working relationships with stakeholders To drive the personal growth and business impact of our employees, we’re committed to developing a supportive and enriching culture for everyone. From employee affinity groups, to fertility assistance and a generous parental leave policy, we value our employees’ wellbeing and want to support them along every step of their professional and personal journeys. Learn more about what it’s like to work at MongoDB, and help us make an impact on the world!MongoDB is committed to providing any necessary accommodations for individuals with disabilities within our application and interview process. To request an accommodation due to a disability, please inform your recruiter.MongoDB, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type and makes all hiring decisions without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
  "job_function": "Finance and Sales",
  "employment_type": "Full-time",
  "industries": "Information Technology and Services, Computer Software, and Internet"
 },
 {
  "job_id": "2613776909",
  "title": "Videographer",
  "company": "Swervnation",
  "place": "Greater Chicago Area",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/videographer-at-swervnation-2613776909?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=AeKlTmfWkHyRHKH5uhTffA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "I need music videos every week and photos shoot please have location",
  "job_function": "",
  "employment_type": "Contract",
  "industries": ""
 },
 {
  "job_id": "2613752151",
  "title": "Data Analyst (Nashville,TN)",
  "company": "TenantBase",
  "place": "Nashville, TN",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/data-analyst-nashville-tn-at-tenantbase-2613752151?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=dcDZ6z4oohZzJyQEVXn4%2FA%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "We believe technology can bring together the three pillars of commercial real estate for a radically improved leasing experience Tenants are why commercial real estate exists. Great companies looking for space are the top of the value chain, and they deserve the simplicity and convenience consumers have come to expect from online services and tools. TenantBase addresses that gap, with tools that empower tenants in the leasing process, providing more transparency, and saving time and money by streamlining traditional processes. Landlords ultimately want the right tenant for their space. Instead of hoping that broad marketing connects, TenantBase's TenantBoard empowers the leasing side to see and engage with individual tenants that are a good match for their space. Brokers need to focus on completing deals while providing great service. Prospecting for new business on top of that is a huge challenge. TenantBase's Broker Partner Program, powered by cutting edge artificial intelligence and backed by our broker support team, connects commercial real estate professionals with qualified tenants so they can focus on serving clients with their local expertise. TenantBase's mission is to be the largest, most trusted, tenant-focused commercial real estate marketplace in the world.What You'll DoYou will work with Management, Product, and Engineering to turn data into information, information into insight, and insight into business decisions. You should be able to think critically about our business, operate independently under ambiguity, and pay keen attention to detail.Note This is an on-site role for our Nashville, TN office.Responsibilities Prepare reports for executive leadership that effectively communicate trends, patterns, and predictions using relevant data. Collaborate with programmers, engineers, and organizational leaders to identify opportunities for process improvements, recommend system modifications, and develop policies for data governance. Work alongside our data science team process data and gain unique insights Creating appropriate documentation that allows stakeholders to understand the steps of the data analysis process and duplicate or replicate the analysis if necessary. Requirements 2+ Proven working experience as a Data Analyst or Business Data Analyst Strong knowledge of and experience with reporting packages (Looker etc), databases (Postgres/Snowflake/Redshift/etc), programming (SQL, Python, or ETL frameworks) Expertise regarding data models, database design, data mining and segmentation techniques. Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy. Benefits Competitive salary and meaningful equity Comprehensive medical, dental, vision, and vision benefits Flexible work schedule, paid time off, 9/80 schedule (every other Friday off) Remote work options",
  "job_function": "Engineering",
  "employment_type": "Full-time",
  "industries": "Commercial Real Estate, Internet, and Real Estate"
 },
 {
  "job_id": "2613789827",
  "title": "Operations Assistant",
  "company": "CCS Fundraising",
  "place": "Chicago, IL",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/operations-assistant-at-ccs-fundraising-2613789827?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=v5f6tYi4ZC98EKRg5OLZDw%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "About CCS: CCS Fundraising is an international strategic fundraising firm that partners with nonprofits for transformational change. For seven decades, CCS has empowered many of the world’s greatest organizations across sectors to advance some of the most important causes in history. We plan, manage, and implement programs and initiatives that achieve fundraising goals and mission impact. CCS provides tailored support to more than 400 nonprofit organizations annually. Headquartered in New York, the firm has over 250 professionals and more than a dozen offices throughout the United States and Europe. Our people are our greatest strength. At CCS, you will join a diverse team of smart, passionate, and resourceful professionals who are driven by purpose and committed to performance.Job Purpose: CCS Fundraising is seeking a self-motivated, reliable, and detail-oriented Operations Assistant to help support our Central United States leadership team. The Operations Assistant will lead in all scheduling, coordinate travel, process expenses, manage vendor relationships, and offer additional support to the operations team. The ideal candidate is highly resourceful, detail-oriented, professional, and capable of managing a heavy workload and prioritizing tasks in a fast-paced, deadline-driven corporate environment. This is an excellent opportunity to build a career in a mission-driven, growing company with competitive compensation and benefits.ResponsibilitiesManage day-to-day operations of the office, including taking calls, interfacing with clients and CCS personnel, responding to emails and managing office security accessProvide scheduling, travel, and expense processing support to the executive team; areas of focus include:Interfacing with internal and external audiences to schedule meetings and callsManaging the complex calendars of executive team membersMaking travel and hotel reservations; including tracking airline credits and rewards programsPreparing timely expense reports and cash reimbursement requestsParticipating in weekly operations meetings to provide insight on schedules and support the facilitation of next stepsUpload and track key documents and information in company-wide databasesDevelop and sustain a level of professionalism, among staff and clientele, consistent with the firm’s mission and valuesAdditional duties as assignedQualificationsPrior experience providing executive support as an assistant, executive assistant, office manager, or in business development or similarly focused positionProficient in Microsoft Office, with the ability to become familiar with firm-wide specific programs and softwareHigh attention to detailStrong organizational, project management, and problem-solving skillsImpeccable multi-tasking abilitiesSelf-starter able to drive activity in a fast-paced environmentFriendly and professional demeanorExperience with Concur preferredCCS offers a competitive benefits package and is an Equal Opportunity Employer.",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Nonprofit Organization Management, and Management Consulting"
 },
 {
  "job_id": "2613760252",
  "title": "Marketing Coordinator - Toptracer Range",
  "company": "Topgolf",
  "place": "Dallas, TX",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/marketing-coordinator-toptracer-range-at-topgolf-2613760252?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=kIQWr3W5ebbrZDSul3zGGA%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "OverviewThis position is responsible for supporting marketing campaigns that increase awareness of the Toptracer brand and generate revenue growth for Toptracer Range around the globe. This role heavily interactives with a global team of sales, account management, product and creative teams.Key Responsibilities Develop lead nurturing email campaigns through lead scoring, a clear and compelling call-to-action and email automation to generate qualified leads. Measure effectiveness of campaign results and analyze pipeline activity to understand how inbound marketing campaigns convert or influence leads to refine the process and make reccomendations for future activity through campaign recaps (KPI’s, budgets, financial returns). Plan global conferences, regional sales events and webinars by identifying an assembling requirements, establishing contacts and developing schedules and assignments to support the sales team. Bring central marketing campaigns to life in various countries through toolkits tailored to nuances of each market to support range owner/operator customers and drive awareness of the brand. Maintain a directory and inventory of sales support materials, ensuring all resources are current and accurate, coordinating the creation of new materials as needed. Maintain the stock and inventory of promotional items and materials by coordinating requirements with creative, apparel, print, etc. Ensure all marketing materials distributed to range owner/operator community comply with brand standards and are consistent across the globe. Accept ownership for different requests to explore opportunities that add value to supporting sales and partnership initiatives. Key Qualifications Bachelors Degree, Marketing, Communications or Public Relations, required 1+ years of experience with proven understanding of both B2B and B2C marketing tactics and execution that drive results, required 1+ years of experience wtih cross-functional work with ability to lead and manage projects, required 1+ years of experience wtih Golf or sports industry trends, preferred 1+ years of International brand marketing, preferred Agency experience, preferred Must be a problem-solver, resourceful with interpersonal skills Customer-focused with an ability to anticipate customer needs Excellent writing skills for creative, content and business storytelling Project management and coordinating collaboration, organization and communication amongst team members Quantitative skills with analyzing trends, data and measuring results TravelUp to 10% to Industry conferences, sales events, range owner/operator visitsADAThe above statements cover what are generally believed to be principal and essential functions of the job. Specific circumstances may allow or require some incumbents assigned to the job to perform a different combination of duties.EEO StatementTopgolf is a global sports and entertainment community and is committed to equal opportunity and is firmly committed to preventing discrimination and harassment, including sexual misconduct, based on legally protected diversity characteristics (such as race, color, religion, national origin, sex, age, disability, sexual orientation, gender identity or expression, family status, citizenship, genetic information and veteran status) in its application and hiring processes and in its employment decisions. As an affirmative action employer, Topgolf also takes steps to prevent retaliation and to create a respectful, equitable and inclusive environment for our Guests, Associates, business partners, vendors, and the communities we serve.Topgolf is an equal opportunity affirmative action employer and administers all personnel practices without regard to race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity or expression, marital status, veteran status, genetics or any other category protected under applicable law.Topgolf Entertainment Group does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website, employees or Human Resources. Topgolf will not pay fees for unsolicited agency resumes and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Topgolf Entertainment Group and will be processed accordingly without fee.",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Restaurants, Hospitality, and Entertainment"
 },
 {
  "job_id": "2613790283",
  "title": "Administrative Assistant",
  "company": "Robinson Franzman LLP",
  "place": "Atlanta, GA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/administrative-assistant-at-robinson-franzman-llp-2613790283?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=2OA4s5BjNYYplMFzEvT7QQ%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Robinson Franzman LLP (\"Robinson\") is a corporate and commercial real estate law firm dedicated to providing value-driven, creative, and effective results on behalf of its clients. With offices in Atlanta, Georgia, Robinson serves clients across the United States in the financial services, commercial real estate, investment management, private equity, and technology industries. Robinson is committed to providing the highest quality work product in the industry and immediate responsiveness to its client’s needs. Robinson is hiring for an Administrative Assistant to run a busy and fast-paced corporate law practice. The ideal candidate will exhibit high standards, excellent communication skills, and have an ability to take initiative, and prioritize daily tasks. A strong ability to take charge and meet tight deadlines will ensure your success in this multi-faceted role. ResponsibilitiesHandle and coordinate active calendarsSchedule and confirm meetingsEnsure file organization based on office protocolProvide ad hoc support around office as neededOpen. process, and handle incoming and outgoing mailQualificationsBachelor's degree or equivalent experienceStrong interpersonal, customer service and communication skillsAbility to multitaskProficient in Microsoft Office suite",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613810824",
  "title": "Business Analyst",
  "company": "Prudential Financial",
  "place": "New York, NY",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/business-analyst-at-prudential-financial-2613810824?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=fWwM%2FlD%2BmwU4Lv1J36O6mg%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "As a member of Customer Digital Team within the Marketing Organization, the Business Analyst is a versatile role that is focused on developing tools for the Retail Advice and Solutions (RAS) Journey Teams, supporting our Customers, Advisors or Employees. You will help shape and execute on initiatives by analyzing existing processes and systems, helping to assist the teams to build tools that are constituent-focused while also ensuring practicality within existing business rules.This role also works closely with technology partners, designers, and business partners to support the development process and ensure that new digital capabilities and tools meet Objectives and Key Results (OKRs) as defined by the team.This role will focus on all aspects of the end-to-end advisor and customer experience and require operating in an Agile framework. This would include initiatives that explore and test new experiences in market and initiatives that leverage customer insights to rearchitect the current experience.Responsibilities Include Partner with the Product Owner to work with business partners and initiative owners to understand the end user’s needs and pain points to define the requirements in agile stories for development Assist the Product Owner and the agile team to clearly define and sequence the work (e.g., MVP - minimum viable product and beyond, go to market strategy, release schedules) Monitor usage and collect feedback on functionality and experiences developed to ensure it meets the end user’s needs Share insights and progress to promote a customer-centric culture and connect the dots across experiences to inform the broader organization Collaborate across agile teams within the RAS Journey and across other Constituent Journeys (Individual Solutions Group Intermediary, Product and Customer) Qualifications Passionate about improving the Customer and Advisor Experience Able to working a matrix/nonhierarchical environment, embracing an agile mindset to evolve with the business Excellent work ethic and self-motivated with the ability to prioritize, meet deadlines, and manage changing priorities Excellent communication and interpersonal skills to work effectively with team members, leadership, other departments and vendors Strong problem solving, decision making, negotiation, and partnership skills Has a learning mindset to take on versatile roles as required by the team involving analytics, business rule definition, testing, and operationalization Intellectual curiosity, and a willingness to learn, grow, and improve Minimum of 1 year working in one or more business functions (product, marketing, service, technology, customer experience, direct-to-consumer, Retail Advice and Solutions, etc.) Travel required (approx. 10%) -Prudential Financial, Inc. of the United States is not affiliated with Prudential plc. which is headquartered in the United Kingdom.Prudential is a multinational financial services leader with operations in the United States, Asia, Europe, and Latin America. Leveraging its heritage of life insurance and asset management expertise, Prudential is focused on helping individual and institutional customers grow and protect their wealth. The company's well-known Rock symbol is an icon of strength, stability, expertise and innovation that has stood the test of time. Prudential's businesses offer a variety of products and services, including life insurance, annuities, retirement-related services, mutual funds, asset management, and real estate services.We recognize that our strength and success are directly linked to the quality and skills of our diverse associates. We are proud to be a place where talented people who want to make a difference can grow as professionals, leaders, and as individuals. Visit www.prudential.com to learn more about our values, our history and our brand.Prudential is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, ancestry, sex, sexual orientation, gender identity, national origin, genetics, disability, marital status, age, veteran status, domestic partner status , medical condition or any other characteristic protected by law.The Prudential Insurance Company of America, Newark, NJ and its affiliates.Note that this posting is intended for individual applicants. Search firms or agencies should email Staffing at staffingagencies@prudential.com for more information about doing business with Prudential.People With DisabilitiesIf you need an accommodation to complete the application process, which may include an assessment, please call (800) 433-8960, prompt 4 or email accommodation.h&w@prudential.com.Please note that the above number and email are solely for individuals with disabilities requesting an accommodation. If you are experiencing a technical issue with your application or an assessment, please email careers@prudential.com to request assistance.",
  "job_function": "Research, Analyst, and Information Technology",
  "employment_type": "Full-time",
  "industries": "Information Technology and Services, Insurance, and Financial Services"
 },
 {
  "job_id": "2613823925",
  "title": "Wealth Relationship Associate",
  "company": "Citi",
  "place": "San Mateo, CA",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/wealth-relationship-associate-at-citi-2613823925?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=dbByE5y8gp0P3ut7sNM%2Brw%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job Id: 21313971The Relationship Associate - SAFE ACT is a developing professional role. This role identifies policy and applies specialty knowledge in monitoring and assessing processes and data. Integrates established disciplinary knowledge within own specialty area with basic understanding of related industry practices. Good understanding of how the team interacts with others in accomplishing the objectives of the area. Develops working knowledge of industry practices and standards. Must be able to exchange information in a concise and logical way as well as be sensitive to audience diversity. Limited but direct impact on the business through the quality of the tasks/services provided. Impact of the job holder is restricted to own team.Responsibilities:The Relationship Associate will be responsible for providing a remarkable client experience and deepening relationships of Private Bank clients.The Manager Associate will utilize a team-based approach to provide potential solutions to a client’s complex financial needs.Serve as the primary point of contact, responsible for retail sales, service and client experience for Citigold ‘Service’ clients SalesConduct banking discussions with clients to understand client needs; clearly create, communicate, and execute solutionsIdentify new business, build and deepen relationships to gain incremental wallet share, and cross sell opportunities within the assigned portfolioEnsure productivity, service and client satisfaction indicators are above the minimum defined standardRefer opportunities to segment partners where appropriateTake ownership of the client experienceEnsure client’s documentation and information is up to date and complete according to the regulatory requirements. Follow up on documentary exceptions until they are regularized.Ensure full accomplishment of all risk, compliance and control policies and procedures for the assigned portfolio and the unit (i.e. KYCs, AML alerts, EUDD, COB, MCA, etc.).Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Qualifications:0-2 years relevant experiencePositive spirit, energetic and enthusiastic Experience financial services with a strong knowledge of banking and credit products Ability to establish relationships and partner effectively with other departments or businesses within Citi including salesKnowledge of Citi’s products and services including features and benefits of product packages, fee structures, etc. Knowledge and understanding of global, regional and local sales and service end-to-end processes including policies and proceduresEducation:Bachelor's/University degree or equivalent experience-------------------------------------------------Job Family Group: Private Client Coverage-------------------------------------------------Job Family:Relationship Banker------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency Posting",
  "job_function": "Sales and Business Development",
  "employment_type": "Full-time",
  "industries": "Banking, Financial Services, and Investment Banking"
 },
 {
  "job_id": "2613823949",
  "title": "Program Director",
  "company": "TerraCorps",
  "place": "Lowell, MA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/program-director-at-terracorps-2613823949?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=bSVTTwJYrEcz041%2B%2Fgg8Cg%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Massachusetts Program Co-Directors (PCDs) are key staff members of the AmeriCorps Program Circle, responsible for the implementation of the TerraCorps service model on a state-wide scale. They play a primary role in managing Service Member experience and Service Site Partner relationships for our AmeriCorps programs. The Program Co-Directors work to successfully implement the TerraCorps service model by cultivating strong partnerships and supporting TerraCorps members’ service experience and professional development. Reporting to the TerraCorps Chief Program Officer, PCDs will work in pairs to oversee up to 48 Service Members and 25 Service Site Partners. We are looking to add capacity to the Massachusetts Program team. PCDs have the following key areas of accountability: Accountabilities:• Managing productive relationships with TerraCorps Service Site partners• Coordinating and participating in Service Site partner recruitment and selection• Administering AmeriCorps Member recruitment, selection, and onboarding and advising on Members on benefit utilization• Designing and facilitating AmeriCorps program orientation and TerraCorps systems training for Members and Site Supervisors• Coordinating logistics for all-corps events (venues, housing, travel, food, etc.)• Reviewing Member service plans for AmeriCorps compliance and providing feedback on Ends policy alignment• Conducting periodic Member check-in calls to provide service-life troubleshooting• Conducting mid- and end-of-year Member service evaluations and Service Site visits• Producing and managing weekly program communication media• Cooperating with Evaluation Systems Designer to monitor Member performance measurement and troubleshoot data collection issues• Monitoring Member timesheets and troubleshooting service hour deficiencies• Organizing peer-to-peer and alumni-led Member learning and support experiences.• Providing a main point of contact for members and Service Site Partners for problem solving service-related issuesThe PCD roles call for strong organizational skills, experience with and understanding of the environmental sector, and ability to think critically, question with curiosity, and listen to resolve interpersonal conflict. PCDs are able to exhibit patience, empathy and excitement while supervising Service Members and supporting Service Site Partners. Organizational Approach: If you’re a person who would thrive in a collaborative start-up atmosphere and wants to put your expertise in program operations, partner relationship management to use towards environmental and social good, we want to meet you. TerraCorps celebrates difference and embraces the impact that diversity of thought, experience, and identity has on our organization. Please visit our website, review our Leadership Structure Page (link) and read our staff bios. If you are comfortable doing so, please tell us in your cover letter why you would consider yourself to be a cultural add to our organization. TerraCorps is an equal opportunity employer. Women, people of color, and LGBTQ+ individuals are encouraged to apply. Experience with national service, and more specifically, AmeriCorps or TerraCorps experience a plus. Compensation: $40-$50K salary commensurate with experience; health & supplemental insurance benefits, retirement plan w/company match, FSA, paid time off (3 weeks vacation, 11 flex-holidays, 8 personal days, sabbatical after 5 years), paid parking, and a flexible schedule.To Apply: Visit our website to apply. Please note on your cover letter how you heard about this position. If you have questions about the position, please send an email to Maria E. Infante, Chief People and Culture Officer, at minfante@terracorps.org. No phone calls please.",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613805145",
  "title": "Data Entry",
  "company": "Brilliant®",
  "place": "Arlington Heights, IL",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/data-entry-at-brilliant%C2%AE-2613805145?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=lLxsAux4G5D3yd6YYy%2BCvw%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Brilliant Financial Staffing has been engaged in a search for a Data Entry Specialist with our client located in Arlington Heights, IL. Our client is looking for a Data Entry Specialist to assist them on multiple projects. The company is in the retail industry and they are looking for a Data Entry Specialist who can assist them in updating vendor information, entering payments via 10-key, and uploading/downloading data in Excel. This Data Entry Specialist needs to be very detailed oriented and possess a 10-key stroke of 8,000+. The ideal candidate would be able to interview asap and start shortly after with the company on a Temporary to Permanent basis.Role And Responsibilities Enter approximately 50 AP invoices daily via 10-key Upload and download files within Microsoft Excel Update vendor contact information in their system Perform filing and scanning of documents Assist the accounting team with administrative tasks Other responsibilities as assigned Qualifications Must possess a 10-key stroke above 8,000 Strong attention to detail Ability to multi-task Experience utilizing Microsoft Excel If you or anyone you know is qualified and interested, please apply ASAP!",
  "job_function": "Administrative",
  "employment_type": "Temporary",
  "industries": "Information Technology and Services, Financial Services, and Accounting"
 },
 {
  "job_id": "2613804447",
  "title": "Coordinator, CRM",
  "company": "Favor Delivery",
  "place": "Austin, TX",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/coordinator-crm-at-favor-delivery-2613804447?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=QA1oK9C8SLiSRFHrOAHyjg%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "We are looking for a CRM Marketing Coordinator who will be responsible for growing, managing and organizing our consumer email, push, and in-app campaigns. CRM is core to how we build relationships with, drive engagement and customer retention to be the best delivery service in Texas.ResponsibilitiesExecute CRM marketing campaigns to include email, push, and in-app messaging Setup, QA, and manage discounts and promotions within CRM ToolingWork within marketing automation campaigns, as well as one-off email or push notification campaignsA/B Testing creative and promotional campaignsWrite compelling copy for Emails, pushes, and a wide range of promotional and operational materialCreate and maintain a CRM calendar for all markets/channelsRespond to internal inquiries and comments from stakeholdersUtilize 3rd party CRM & analytic tools to track and report progressAssist with administrative tasks within the marketing departmentRequirementsBA or BS Degree in Marketing or Communications related fieldEmail Marketing, CRM Tool, or Analytics experience Strong written and communicative skillsWillingness to take on projects with a proactive attitudeAbility to work independentlyDesire to learn and grow within the role and companyTechnology/App experience highly desiredBraze Experience a plusAt Favor, we believe that to Run Texas, we need to represent Texas. By putting Community First , we honor the diversity of our backgrounds and experiences through sharing our unique voices. Our community grows when we challenge ourselves to learn and see the world from another’s view. We are committed to growing a team with different backgrounds, experiences, abilities, and perspectives and are an equal opportunity employer.",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Computer Software, and Internet"
 },
 {
  "job_id": "2613817864",
  "title": "Real Estate Analyst",
  "company": "Berkadia",
  "place": "Chevy Chase, MD",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/real-estate-analyst-at-berkadia-2613817864?refId=KevYXG2%2FDFvu5V%2FNRJp2mw%3D%3D&trackingId=lq3WOao9U9IOJGGOzlHXOw%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Berkadia, a joint venture of Berkshire Hathaway and Jefferies Financial Group, is a leader in the commercial real estate industry, offering a robust suite of services to our multifamily and commercial property clients. Powered by deep relationships and industry-changing technology, our people sell, finance, and service commercial real estate, providing support for the entire life cycle of our clients’ assets. Our unique ownership structure allows us to put the client’s interests first and creates a marketplace that delivers a superior experience.The OpportunityThe Real Estate Analyst, GSE Small Loans will work with credit and production to manage the origination and underwriting process for Fannie Mae & Freddie Mac Small Loans ($750k - $7.5MM in select markets). Provide initial review of deal opportunities and recommend best course of action and product execution Work closely with agency contacts to obtain the necessary waivers and approvals (if necessary) Analyze and review borrower credit information and structure, third party reports, property financial and physical information to determine deal viability Perform site inspection due diligence to evaluate market competitiveness of the proposed collateral and to determine economic feasibility of the projected income stream Prepare underwriting narratives and independent cash flow value estimates Present recommendations to the appropriate approval committee, including all key documentation (term sheets, applications, commitments, credit memos, etc.) Manage and train a dedicated team of analysts Communicate consistently with Berkadia’s Mortgage Banking production network and manage borrower clients through the approval and closing process Manage the closing process and deliver the necessary documents and loan information to Berkadia’s servicing team and agencies Educate Berkadia’s Mortgage Banking production network on agency requirements and available loan products for small loans Work collaboratively with the Mortgage Banking production network to market the various loan products to their borrower clients Conduct and participate in customer meetings and conference calls Other duties as assigned. What someone will need to be successful in this role Proficient in financial analysis and risk mitigation Advanced experience in Microsoft Office including Outlook, Word, PowerPoint, and Excel Strong organizational skills and ability to multitask in a fast-paced environment with competing priorities Outstanding attention to detail Strong communication skills and ability to manage expectations of both internal and external customers Willingness to work in a dynamic environment and adapt to continually evolving technology Applicants who require accommodations to participate in the interview process should contact the Talent Acquisition Team to arrange for such accommodations by emailing: Talent.Acquisition@Berkadia.comBerkadia does not share salary ranges in its job postings. Any salary-related information you see posted externally has not been provided or verified by Berkadia and may not be accurate.Berkadia is an equal opportunity employer and affords equal opportunity to all applicants and employees for all positions without regard to race, color, religion, gender, national origin, age, disability, veteran status or any other status protected under local, state or federal laws.By applying to this job opportunity you are acknowledging Berkadia's Privacy Policy. Applicants have rights under Federal Employment Laws. Please click the following links for more information: EEOC, Employee Rights under the FMLA, EPPA.",
  "job_function": "Sales and Management",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Information Technology and Services, and Financial Services"
 },
 {
  "job_id": "2613816832",
  "title": "Research Associate",
  "company": "Harvard University",
  "place": "Boston, MA",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/research-associate-at-harvard-university-2613816832?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=whs6bwe8BOp9PMHqrS4Wgg%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job-Specific ResponsibilitiesThe Harvard Business School seeks a Research Associate to assist in delivering the first year MBA course, The Entrepreneurial Manager (TEM). The course is well-liked by students and is taught by a group of dedicated faculty who bring a range of academic and professional experiences to the topic of entrepreneurship. The course invites 900+ students to learn how to lead amidst extreme uncertainties. A curious and talented RA will help make TEM even more effective with students at a time of great opportunity and looming questions for entrepreneurs in the U.S. and around the world.The RA will engage with the course faculty on course development, content creation, and execution. This work will cover a range of core subjects, including: the design and development of new business models; financing entrepreneurial ventures; the hiring and management of people at early stage ventures, and scaling startup firms.These Include, In Partnership With The Faculty Teaching GroupThe RA will collaborate on several activities to support the delivery of a highly successful case-based course.Writing and updating Harvard Business School cases on entrepreneurial ventures, which serve as the centerpiece of the course;Creating teaching notes and other teaching materials related to these cases, drawing on key lessons from these episodes and core findings in the academic literature;Synthesizing key concepts from scholarship in economics, sociology, history, and other disciplines that touch on entrepreneurship in ways that make them accessible to a wide range of students;Developing quantitative exercises, primarily based in Excel, to help students learn the tools and techniques of entrepreneurial finance and of measuring and monitoring inside new firms;Researching and sharing timely developments in entrepreneurship that may shed new insight into individual cases or the course as a whole; andPreparing and assessing assignments, exams, and other course tools.Other duties as assigned.They RA may provide tutorial support to students outside the classroom.The RA will attend all faculty teaching-group meetings.Ideal candidates will be comfortable in an environment that requires an exacting level of quality and intellectual rigor. They will enjoy collaborating with HBS faculty. They will be keenly interested in the topic of entrepreneurship; they may bring outside experience or academic interest to the subject. They will believe in the potential that outstanding teaching brings to a course and the partnership that engaged students and dedicated teachers share in the classroom.Basic QualificationsAdvanced degree or bachelor’s degree with significant years of relevant work experience.MBA, MS in Finance, or Ph.D. level work can be helpful.Additional Qualifications And SkillsEvidence of academic excellence and careful, skillful writing is required. 2-4 years of relevant work experience is desired. The successful candidate must have a strong quantitative background and experience creating or extensive experience using technical tools such that they could develop them for others; have solid financial, analytical, conceptual skills; work well independently; and be at home in an academic environment. Excellent communication, interpersonal, organization, research, writing, and editing skills are required. Successful candidates will demonstrate a proven ability to handle multiple projects simultaneously and to flexibly adapt to changes in priorities; to work calmly under deadline pressure; to work both independently and as a team member; to take initiative; and to follow projects through to completion. All positions will be given a writing exam. The ability to read academic, subject-specific information and write a reasoned and thoughtful analysis or produce a synthesized interpretation, is necessary. Diplomacy, integrity, and judgement are a must.Additional InformationThis is a half-time appointment starting this summer (start date flexible) through June 30, 2022 with potential for reappointment. All HBS RA roles are structured as one-year term appointments with potential for renewal.Applications will be considered on a rolling basis, a cover letter and resume are required for full consideration. Upon the review of application materials, applicants may be asked to submit a writing sample, and transcript(s). All positions will be given a writing exam.Harvard Business School does not offer visa sponsorship for this opportunity.While we continue to monitor the evolving COVID-19 guidelines and restrictions, we appreciate your understanding and flexibility with our interview process. Please note that we will be conducting interviews virtually (phone and or Zoom) for selected candidates until further notice.Culture of Inclusion: The work and well-being of HBS is profoundly strengthened by the diversity of our network and our differences in background, culture, national origin, religion, sexual orientation, and life experiences. Explore HBS work culture.Job FunctionResearchLocationUSA - MA - BostonJob CodeRS0056 Researcher II HumanitiesSub-UnitDepartmentDivision of Research and Faculty DevelopmentTime StatusPart-time Salary Grade 056Union00 - Non Union, Exempt or TemporaryAppointment End Date30-Jun-2022Pre-Employment ScreeningEducation, IdentityEEO StatementWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, gender identity, sexual orientation, pregnancy and pregnancy-related conditions, or any other characteristic protected by law.",
  "job_function": "Research, Analyst, and Information Technology",
  "employment_type": "Part-time",
  "industries": "Nonprofit Organization Management, Financial Services, and Hospital & Health Care"
 },
 {
  "job_id": "2613788444",
  "title": "Marketing Coordinator",
  "company": "Artisanal Brewing Ventures",
  "place": "Charlotte, NC",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/marketing-coordinator-at-artisanal-brewing-ventures-2613788444?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=Qd8pe%2FNDDVu54x8RtRfOsQ%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Marketing CoordinatorPosition SummaryThe Marketing Coordinator is responsible for assisting the brand teams in implementing key marketing programming and brand deliverables via social content and brand marketing support.Key Responsibilities Assisting in the creation of monthly brand social calendars across platforms to bring brand persona to life and support marketing calendar. Execution and scheduling of monthly content, including plans to capture message/targeting testing. Data collection and monthly reporting for campaigns and social efforts. Assistance in creating sales materials and program support tools Program and media execution support such as sampling distribution, consumer surprise and delight fulfillment and other needs. Consumer engagement and monitoring across social pages. Additional support to analyze effectiveness of consumer programs utilizing internal and external data and partnering with ABM to make recommendations to modify elements or changes in strategic direction. Perform other business-related duties as assigned. Key Competencies People Agility - Uses a high interpersonal effectiveness and effective written and verbal communication, along with a consistent and positive energy, to gain trust and support across the team.Agile Learning - A curious learner who quickly assesses complex problems, seeing the big picture and adapting past experiences to new situations, to create opportunities and overcome challenges.Motivation & Tenacity - Self-starter who knows how to prioritize multiple projects to get things done at a high level.Results Orientation - Displays drive and initiative and focused on delivering the desired outcomes, but getting there through teamwork, collaboration, and aligning to ABV values.Collaborate - Works cooperatively with others across the organization to achieve shared objectives. Represents own interests while being fair to others and other areas. Partners with other to get work done. Credits others for their contributions and accomplishments. Gains trust and support of others.Position Requirements Bachelor’s degree or some College preferred Approximately 1 year of related/relevant experience required Proficient in Excel & PowerPoint Highly proficient as a social media user Design, photography, and/or copywriting experience is preferred Beer/Adult Beverage experience is not a requirement DisclaimerThis Job Description is only a summary of the typical functions of the job, not an exhaustive or comprehensive list of all possible job responsibilities, tasks and duties.Artisanal Brewing Ventures is an Equal Opportunity Employer",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Food & Beverages, Food Production, and Consumer Goods"
 },
 {
  "job_id": "2613835046",
  "title": "Southeast Asia Administrator",
  "company": "University of North Carolina at Chapel Hill",
  "place": "Chapel Hill, NC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/southeast-asia-administrator-at-university-of-north-carolina-at-chapel-hill-2613835046?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=GKEJhRv4AnsmjwK5AyeUBw%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "",
  "job_function": "",
  "employment_type": "",
  "industries": ""
 },
 {
  "job_id": "2613823920",
  "title": "Reservations Coordinator",
  "company": "Hilton",
  "place": "Coronado, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/reservations-coordinator-at-hilton-2613823920?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=1VAll5yR4judrn1Mjdy5iw%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "As a Reservations Coordinator, you will use your strong technical skills, excellent communication skills, persuasive sales ability and world class customer service to consult with customers and book customized hotel reservations via email/phone.What will I be doing?ResponsibilitiesSpecifically, you would be responsible for performing the following tasks to the highest standardsAs a Reservations Coordinator, you would be responsible for assisting group reservations in the hotel’s continuing effort to deliver outstanding guest service and financial profitability.Answer telephones in a professional, courteous manner with proper greeting and closing, providing personalized guest service.Proactively promote/sell hotel services and offerings to the Hotel’s guests and callers, delivering on revenue expectations.Must have complete knowledge of all dining venues and take reservations for dining with accuracy.Must have current knowledge of all key personnel and departmental functions in the hotel.Operate computers and multiple phone lines. Keep management informed of pertinent guest and personnel issues.Monitor and action systems as assigned to include but not limited to email inboxes, text/chat platforms, interdepartmental communication systems, radio communication, all phone ques, fax machines, etc. Perform any tasks related to communicating and selling to guests or tasks related to the hotel operation as assigned.Attend weekly meeting with GRC and be prepared to discuss the next seven days group arrivals in detail. Ensure all VIP and Contact reservations are annotated as such and have an approximate arrival time.Attend scheduled Pre-Convention meetings. Meet with contact at least once during conference. What are we looking for?Specifically, We Look For Demonstration Of These ValuesSince being founded in 1919, Hilton has been a leader in the hospitality industry. Today, Hilton remains a beacon of innovation, quality, and success. This continued leadership is the result of our Team Members staying true to our Vision, Mission, and Values.Hospitality - We're passionate about delivering exceptional guest experiences.Integrity - We do the right thing, all the time.Leadership - We're leaders in our industry and in our communities.Teamwork - We're team players in everything we do.Ownership - We're the owners of our actions and decisions.Now - We operate with a sense of urgency and disciplineIn addition, we look for the demonstration of the following key attributes:QualityProductivityDependabilityCustomer FocusAdaptabilityWhat will it be like to work for Hilton?Hilton is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Hilton has offered business and leisure travelers the finest in accommodations, service, amenities and value. Hilton is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision “to fill the earth with the light and warmth of hospitality” unites us as a team to create remarkable hospitality experiences around the world every day. And, our amazing Team Members are at the heart of it all!Work LocationsHotel del Coronado, Curio Collection by HiltonScheduleFull-timeBrandCurio Collection by HiltonShiftFull AvailabilityJob LevelTeam MemberJobCall Center and Reservations",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Restaurants, Food & Beverages, and Hospitality"
 },
 {
  "job_id": "2613796909",
  "title": "Creative Content Writer",
  "company": "Lowcountry Land Trust",
  "place": "Charleston, SC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/creative-content-writer-at-lowcountry-land-trust-2613796909?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=CelEqoh3yqts2EPEj%2BRdpg%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Position: Creative Content WriterPosition Type: Full-timeReporting: Chief Advancement OfficerLocation: Charleston, SC (Remote from Home) Application Instructions:To apply, please email a cover letter and resume in one PDF to:Kate Durand, Communications Managerkdurand@lowcountrylandtrust.org POSITION SUMMARYLowcountry Land Trust (“LLT”) seeks a Creative Content Writer (“CCW”) who will perform basic communications tasks that the LLT Advancement Team needs to execute our editorial calendar and overall communications and fundraising strategy. The CCW is an individual who is highly skilled at developing dynamic and compelling narratives that inspire and engage audiences across various media. These stories will drive the content of our website, social media, printed materials, and grant proposals, and will embody the voice of the organization through the written word. Reporting to the Chief Advancement Officer, the CCW will compose content according to the editorial and fundraising calendars developed by the Communications Manager and Chief Advancement Officer, and is an integral member of the Advancement Team. This is an entry-level position, and we encourage applicants who are ready to learn and hone their skills. RESPONSIBILITIES Communications Writing:Serve as the in-house copywriter, assisting and collaborating to create content in adherence to LLT’s editorial calendar, overarching themes, branding, and strategy.Draft and post social media content on LLT’s established social channels with the opportunity to assist in expanding to new channels.Assist in the assembly of our monthly newsletter (writing/editing support where needed, uploading blog posts, building the email newsletter template). Assist in procuring content to build out new series/ programs as they are strategized.Create and/or collaborate on the development of written communications, including social media and blog posts, press releases, newsletters, fundraising appeals, and other marketing copy.Grant Coordination:Prepare proposals by determining concept, gathering and formatting information, writing drafts, and obtaining approvals.Meet proposal deadlines by establishing priorities and target dates for information gathering, writing, review, approval, and transmittal.Develops proposal by assembling information including project nature, objectives/outcomes/deliverables, implementation, methods, timetable, staffing, budget, standards of performance, and evaluation.Writes, revises, and edits drafts including executive summaries, conclusions, and organization credentials.Maintains quality results by using templates; following proposal-writing standards including readability, consistency, and tone; maintaining proposal support database (Raiser’s Edge).Updates job knowledge by participating in educational opportunities; maintaining personal networks. QUALIFICATIONSRequired:Bachelor’s degree in Communications, Marketing, Design, Journalism, Creative Writing, English, or a related field from an accredited institution of higher education. 0-4 years of experience (entry level).Must have excellent written and verbal communication skills.Excellent leadership, collaboration, time management, organizational, communication, and interpersonal skills.Proficiency in organizing and prioritizing tasks in a fast-paced environment.Demonstrated capacity to develop narratives based on prompts or concepts.Passion for conservation and the Lowcountry.Ability and confidence to learn and adapt.Preferred:Familiarity with G Suite and Microsoft Office.Experience with Canva, InDesign and Photoshop.Experience with content management systems.Familiarity with project management software (Monday.com) and donor database (Raiser’s Edge).Familiarity with video development and simple editing software.REMOTE WORK REQUIREMENTSPhone (mobile or landline)Reliable internet Printer (if needed)LLT will provide the following:Laptop, mouse, keyboard, monitor Desk and chair (if needed)Office supplies (paper, pens, organizers, stapler, etc.)BENEFITSInsuranceHealth Insurance - 100% Employer Paid for EmployeeDental Insurance – 100% Employer Paid for EmployeeLife Insurance ($10,000)Long Term DisabilityFinancial & Retirement403(b) – 5% Match and Fully VestedFamily & ParentingMaternity & Paternity LeaveRemote Work/Work from Home Day(s)Flexible HoursPaid Time OffUnlimited vacation and sick days11 Paid Holidays Flexible Summer Schedule Perks Dog Friendly WorkplaceMobile Phone Reimbursement ($20 per month)Health & Wellness Positive EnvironmentLowcountry Land Trust is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613778729",
  "title": "Administrative Assistant",
  "company": "Marriott Hotels",
  "place": "Los Angeles, CA",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/administrative-assistant-at-marriott-hotels-2613778729?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=PctqJGqFfhJ903QbnLLjfg%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Posting Date Jun 21, 2021 Job Number 21063055 Job Category Administrative Location Los Angeles Airport Marriott, 5855 West Century Boulevard, Los Angeles, California, United States VIEW ON MAP Brand Marriott Hotels Resorts Schedule Full-Time Relocation? N Position Type Non-Management Located Remotely? N Marriott International portfolio of brands includes both JW Marriott and Marriott Hotels. Marriott Hotels, Marriott International’s flagship brand with more than 500 global locations, is advancing the art of hosting so that our guests can travel brilliantly. As a host with Marriott Hotels, you will help keep this promise by delivering premium choices, sophisticated style, and well-crafted details. With your skills and imagination, together we will innovate and reinvent the future of travel. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 80 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. It’s as simple as that. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy a true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can really pursue your passions in a luxury environment. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. POSITION SUMMARY Enter and retrieve information contained in computer databases using a keyboard, mouse, or trackball to update records, files, reservations, and answer inquiries from guests. Transmit information or documents using a computer, mail, or facsimile machine. Operate standard office equipment other than computers. Prepare letters, memos, and other documents using word processing, spreadsheet, database, or presentation software. Handle incoming and outgoing mail, including date stamping and distributing incoming mail. Create and maintain computer- and paper-based filing and organization systems for records, reports, documents, etc. Compile, copy, sort, and file records of office activities, business transactions, and other activities. Enter and locate work-related information using computers and/or point of sale systems. Follow all company policies and procedures, ensure uniform and personal appearance are clean and professional, maintain confidentiality of proprietary information, and protect company assets. Welcome and acknowledge all guests according to company standards, anticipate and address guests’ service needs, assist individuals with disabilities, and thank guests with genuine appreciation. Speak with others using clear and professional language, prepare and review written documents accurately and completely, and answer telephones using appropriate etiquette. Develop and maintain positive working relationships with others, support team to reach common goals, and listen and respond appropriately to the concerns of other employees. Move, lift, carry, push, pull, and place objects weighing less than or equal to 10 pounds without assistance. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott International considers for employment qualified applicants with criminal histories consistent with applicable federal, state and local law.",
  "job_function": "Administrative, Other, and Customer Service",
  "employment_type": "Full-time",
  "industries": "Hospitality, Leisure, Travel & Tourism, and Food & Beverages"
 },
 {
  "job_id": "2613823905",
  "title": "Community Investing Analyst",
  "company": "Citi",
  "place": "New York, NY",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/community-investing-analyst-at-citi-2613823905?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=Gw32xldcYG3%2F%2F8RTG2NDQg%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job Id: 21318230The Community Investing Analyst will work across the function on projects that support strategic planning, economic opportunity flagship programming and amplifying Citi’s community investing efforts. The Analyst will also provide some senior leadership executive support. Citi’s Community Investing and Development team works to enhance Citi’s positive social impact through equity investing, innovative financial solutions, and strategic philanthropy. This dynamic role will provide the opportunity to gain broad insight into community investing efforts while helping to drive organizational priorities. The ideal candidate is able to prioritize and manage a range of both programmatic and operational projects.Key Responsibilities:Provide project management and reporting support for flagship initiatives and priority special projects such as Citi’s Action for Racial Equity commitment and Community Investing and Development strategic planningPlay a key role in the execution and tracking of process improvement and efficiency effortsSupport team integration and talent development efforts, including organization chart management, new team member on-boarding, and coordinating all-staff and leadership team meetings and agenda contentContribute to the creation and review of senior leadership presentations and communications projectsProvide calendar management and travel planning support to the Head of Community Investing and Development/Citi Foundation President as necessary, including preparing briefing packages and coordinating complex travel agendasProvide additional special projects support as necessaryQualifications:An interest in learning about and contributing to a corporate social impact functionComfort with taking on new assignments and learning new things Excellent project management and organizational skillsAbility to prioritize and manage projects in a fast-paced environmentCapacity to work independently, and as a self-starterExcellent interpersonal and communication skills (verbal and written)Extremely detail oriented, reliable, and professionalProficiency in Microsoft office suiteThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.-------------------------------------------------Job Family Group: Communications and External Relations-------------------------------------------------Job Family:Community Development------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency Posting",
  "job_function": "Business Development and Sales",
  "employment_type": "Full-time",
  "industries": "Banking, Financial Services, and Investment Banking"
 },
 {
  "job_id": "2613790283",
  "title": "Administrative Assistant",
  "company": "Robinson Franzman LLP",
  "place": "Atlanta, GA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/administrative-assistant-at-robinson-franzman-llp-2613790283?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=vyn9YxYwE%2BEWAilzS0Kuvg%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Robinson Franzman LLP (\"Robinson\") is a corporate and commercial real estate law firm dedicated to providing value-driven, creative, and effective results on behalf of its clients. With offices in Atlanta, Georgia, Robinson serves clients across the United States in the financial services, commercial real estate, investment management, private equity, and technology industries. Robinson is committed to providing the highest quality work product in the industry and immediate responsiveness to its client’s needs. Robinson is hiring for an Administrative Assistant to run a busy and fast-paced corporate law practice. The ideal candidate will exhibit high standards, excellent communication skills, and have an ability to take initiative, and prioritize daily tasks. A strong ability to take charge and meet tight deadlines will ensure your success in this multi-faceted role. ResponsibilitiesHandle and coordinate active calendarsSchedule and confirm meetingsEnsure file organization based on office protocolProvide ad hoc support around office as neededOpen. process, and handle incoming and outgoing mailQualificationsBachelor's degree or equivalent experienceStrong interpersonal, customer service and communication skillsAbility to multitaskProficient in Microsoft Office suite",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613819719",
  "title": "Personal Executive Assistant",
  "company": "TalentBridge",
  "place": "Charlotte, NC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/personal-executive-assistant-at-talentbridge-2613819719?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=zzX%2B2yU%2BuACoBu6Py23XLw%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job DescriptionWe are currently recruiting for an experienced personal assistant to support a sucessful business executive in the South Charlotte area. This role will require dedication to supporting him in his personal and professional life as we as ensuring the maintance of his homes in mutiple US locations.EXECUTIVE ADMINISTRATION Review CEO emails inbox and prepare daily document for review with ability to prioritize and track responses. Calendar management, preparation time/materials to review in advance Electronic files management and meeting follow-ups recorded and monitored Regular meeting tracking of group memberships, advisory boards, investor reporting, etc Corporate monthly expense report and submit wire transfer requests to Accounting PARTNER RELATIONSHIPS Notes dictated or transcribed after each meeting and provided before next meeting Google search for any recent major news Maintain database with new business cards and emails TRAVEL/EVENT COORDINATION National and international elite trip planning and experience including private jet charters, airport greeter service when applicable, communication to travel guests, dinner reservations and overall preferences Travel Membership tracking, coordination and renewals (AA Airpass, United PassPlus, Exclusive Resorts, Cuvee, Client Centurion Membership, Jetcard program hours, etc) Organize private events at the home (live music, food, wait-staff if not available, drinks, prep, etc) PERSONAL ASSISTANCE Personal accounting paying bills for private residence, vendors, contractors Prepare QuickBooks spending tracker report quarterly and merge with CFO personal accounting Personal Credit Cards monitored for unusual activity and paid in full accordingly Venmo and Zelle payments to vendors Medical appointments, labs and prescriptions with appropriate timing Submit out of pocket medical expenses to insurance Florida residency car registrations and track dates out of North Carolina state Personal errands and online ordering of supplies as needed Home Management/Auto Maintenance All vehicle, pool, lawn, home maintenance, water plants, fresh flowers - schedule, negotiate when necessary, manage and be present in the home when needed Hands-on role in Charlotte residence for minor repairs, organizing, attention to detail, manage vendors, etc Regular auto maintenance, gas, charged, cleaning, track registrations, ability to drive stick shift a plus&plus; Schedule and manage house cleaning and handyman as needed. Stock kitchen prior to client arrival and anticipate needs Charlotte residence wine cellar inventory entry and tracking whenever new items come in or consumed. Requirements College Degree Valid Driver's License Computer knowledge with Outlook, Word and Excel 5&plus; years of Administrative Assistant experience supporting senior level executives. 24/7 availability via phone/text/email, dedicated office hours Mon-Fri 8:30am-5:30pm and flexible evenings and weekends when needed. Ability to be onsite his SouthPark office when he is in town and private residence as needed. Can work remotely when he is traveling and check packages at both his home and office minimally twice a week when he is away Strong ability to work independently with little supervision; anticipate needs, attention to detail, proactive and organized Must be trust-worthy managing personal finances and confidentiality",
  "job_function": "Administrative",
  "employment_type": "Full-time",
  "industries": "Construction, Staffing and Recruiting, and Financial Services"
 },
 {
  "job_id": "2613748682",
  "title": "Entry-Level Content Writer",
  "company": "Jerry",
  "place": "Los Angeles, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/entry-level-content-writer-at-jerry-2613748682?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=W8JU%2B77kOLwMYD0MdkbsCQ%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "We’d love to hear from you if you are looking for Start-up energy working with a brilliant and passionate team $300 billion market opportunity Exponential growth (10X revenue growth in 2020) Rockstar teammates. You will be working with a strong team with prior work experience at Facebook, Amazon, Microsoft, GEICO, Lending Club, SoFi, etc. About The RoleAs a writer on the Jerry team, you will research and write articles to help our readers make informed decisions about their personal finance and the management of their two most expensive assets, their car and their home. You will play a big role in scaling our organic content across our website, social media channels, ad networks, affiliates and partner sites to continue driving our audience reach and user growth. Working with our talented team of writers and editors, you will play a pivotal role in building and shaping the future of our story.Responsibilities Writing engaging and insightful editorial content that will delight our readers and help them make important decisions about their finances Researching and fact-checking highly sought-after topics across personal finance, insurance, and car and home-related subject matter Adhering to our brand guidelines across all digital media platforms Tracking and analyzing content performance to continue driving visibility across search and social channels Requirements Bachelor Degree in any discipline, preferably in a writing-intensive major (e.g. Journalism, Communications, English Literature, Media, History, Philosophy, Political Science, Sociology, Psychology, etc) Impeccable writing skills including the ability to harness style, tone and voice to appeal to your target audience Strong attention to detail; ability to conduct thorough and meticulous research Strong command of the written English language and an eye for how details can make a big impact Ability to juggle multiple competing deadlines without missing a beat About JerryJerry is building the first financial platform for your car that helps people optimize the cost and experience of owning a car (making ownership easy & affordable). There are 240M cars in the US alone. For most people, cars are one of the most expensive assets they own and families on average spend 20% of their income on car expenses, making this a massive market.We have started with helping people optimize the cost of car insurance and our vision is to help people in every aspect of car ownership. Since our product launch, we have been growing really fast for the past 18 months and our users love the product (rating 4.5 in the app store). Jerry is founded by serial entrepreneurs who previously built and scaled YourMechanic (“Uber for car repair,” the nation’s largest on-demand car repair company). We have raised over $50M+ in financing.",
  "job_function": "Marketing",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Internet, and Financial Services"
 },
 {
  "job_id": "2613831565",
  "title": "Student / Intern",
  "company": "Oracle",
  "place": "California, United States",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/student-intern-at-oracle-2613831565?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=NZaqSSx7z8ryZ%2BZTuJjLMA%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job DescriptionOracle has a unique opportunity for a current college student to do an 2021 summer internship with the North America Talent Advisory team! Our team is responsible for all professional recruiting across Oracle in North America. As an intern, you will be part of the sourcing team and working alongside the sourcing team to learn more about talent acqusition and HR. You will be given requsitions to source and aligned to businesses much like a regular sourcer, but don't worry - we will provide you with training, mentorship, guidance and support as you learn the ropes. Additionally, you will also have a strategic project that you will be working with during the summer along with presentations at the end of the summer. This is a 12 week internship and will be done remotely.Successful sourcers (recruiting research associates) at Oracle will be able to build strategies to identify and attract top talent, partner with clients and talent sourcers to ensure a positive candidate experience and have a deep understanding of the talent market and candidate profiles.Responsibilities Work with Talent Advisors, hiring managers, and other stakeholders to understand recruiting needs and candidate profiles. Create and execute sourcing strategies to identify quality candidates at scale. Focused on delivering a positive and transparent candidate experience. Understand the competitive ecosystem and talent profiles and be able to adjust and creatively source the talent for Oracle Detailed Description And Job RequirementsThe Research Associate is involved throughout the entire value chain of the search process, working in conjunction with recruiters throughout the kick-off, strategy, and execution of search engagements to bring each search to a successful completion.Identify high quality and potential candidates for senior level assignments. Partner and collaborate with executive recruiter. Build intellectual capital and keep up-to-date with key market trends and competitive intelligence. Assist other team members in research and candidate identification of relevant profiles. Support team members in mapping of competitors. Maintain and update internal database while understanding the importance of data integrity. Partner with team member to develop target company lists through market research. Utilize existing tools, resources and technologies to assist in identifying top talentRequired Qualifications Must be a current college student with a graduation date after August 2021 and before May 2023 (Junior or Senior) Must be attending college in the United States, pursuing a BA/BS or a graduate degree. Must be able to complete a 12 week internship Preferred Qualifications Pursuing an HR degree or certification Motivated by an intellectually stimulating recruitment environment with the desire to identify the best talent for Oracle. High self-motivation and the ability to work both autonomously and as part of a team. Excellent communication and organization skills. Intellectually curious and highly analytical individua 10.1.0This job code is utilized for the majority of our temporary hires. The individual is performing hourly job duties as defined under the Fair Labor Standards Act.If you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 105135 in the subject line of the email.About UsInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
  "job_function": "Education and Training",
  "employment_type": "Internship",
  "industries": "Information Technology and Services, Computer Software, and Financial Services"
 },
 {
  "job_id": "2613757348",
  "title": "Associate Brand Manager",
  "company": "Stella & Chewy's",
  "place": "Oak Creek, WI",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/associate-brand-manager-at-stella-chewy-s-2613757348?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=Bvn8wtge9nw%2F6qXmXJ53kQ%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "DescriptionStella & Chewy’s, one of the fastest growing premium pet food companies in the U.S., is looking for an Associate Brand Manager. This person will be critical in helping form a new Brand Management team. You will work in strong collaboration with the broader Marketing team to deliver brand objectives and lead a rapidly growing, highly dynamic business. The ideal candidate is a consumer-centric, insights- and data-driven marketer to help shape an already successful brand in the rapidly growing pet food industry.Reporting to the Senior Brand Manager, this role will play an essential role in helping analyze, develop, and implement annual marketing plans. The ABM will have a deep understanding of our consumer’s needs to drive relevancy and loyalty. The right individual will have a collaborative and confident working style and enthusiasm for making connections with co-workers, external partners, and consumers.Brand Management Contribute to and support comprehensive, short, and long-term strategic plans of the brand strategy. Executes day-to-day responsibilities against business priorities that best align with the strategy.Conduct in-depth analysis to identify opportunities, trends, and recommendations about the brand, competition, category, customer, and consumer to incorporate into the brand planning process.Strong experience in using syndicated data sources such as Nielsen to enable analysis of industry data.Lead and coordinate with legal counsel on key matters such as trademark, copyright, etc. Manage overall marketing team budget; forecast spending, monitor progress of plans, and adjust as needed to meeting timing and budget requirements. Track and report on marketing effectiveness and develop insights and actions to adjust plans to increase ROI.Marketing Communication PlansCoordinate the execution of sponsorships and award applications.Manage the product placement program, including assessment of relevant brand opportunities and providing brand assets for implementation. Assist the industry trade publication media and editorial opportunities to drive awareness and credibility with retailers.Team LeadershipEmbody a spirit of ownership, motivate, and cooperate within an entrepreneurial culture that celebrates a willingness to do what it takes to support the team.Communicate and operate broadly across the organization’s departments, including Innovation, Sales, Marketing, Operations and Finance.Requirements 2+ years of experience in a brand management, Consumer Packaged Goods required. Experience in Pet Food industry a plus. Bachelor’s Degree in Marketing required, with MBA or Master’s in Marketing preferred.Thrives in a fast-paced environment with the ability to shift priorities to meet rapidly evolving business needs.Resilient and creative problem-solver who demonstrates curiosity and strives for constant improvement in ambiguous settings.Significant analytical and critical thinking skills with experience analyzing data and telling stories with data.Strong experience using syndicated data sources (i.e. Nielsen, IRI).Strong attention to detail.Strong written and verbal communication and presentation skills.A strong sense of ownership and personal accountability.High level of independence and resourcefulness.A passion for pets; must be comfortable with dogs and cats.Willingness to travel to conduct market visits, attend trade shows, and support key meetings. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status, or any other status protected by law.",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Information Technology and Services, Computer Software, and Consumer Goods"
 },
 {
  "job_id": "2613826439",
  "title": "Food and Beverage Manager",
  "company": "Confidential",
  "place": "Miami Beach, FL",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/food-and-beverage-manager-at-confidential-2613826439?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=cQIRLbHMo4x1LWsSxNSYMw%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "We are actively seeking a FT Food & Beverage Manager for a luxurious hotel in Miami, FL to create an exciting, innovative, and memorable dining experience for all guests and Lead a well-rounded and knowledgeable front-of-house team. Summary:Daily evaluation of restaurant service performance, coordination of timely food production.Participates in evaluation of food products, kitchen employee performance, and development of products consistent with our market position.Develop a selection and pricing strategy of all liquors and wines and supervision of their procurement.Assist the General Manager in building financial objectives on an annual basis through the budget process.Assist in meeting the financial targets in the sales area by executing and improving the annual marketing plan, reacting quickly to new opportunities, running consistently high operation standards, and effective utilization of marketing funds.Help meet the budget in all areas of cost control with a consistent focus on the cost of sales and payroll.Responsible for communicating with management, employee and accounting staff, identifying developed personnel and providing the necessary training as positions open.All personnel should receive regular, timely and honest evaluations of their performance through the quarterly Check-In.Implement and conduct ongoing training programs for new and existing management and employee staff.Responsibility for the daily cleanliness of the restaurant both internally and externally by coordinating kitchen cleanliness and service area maintenance with the GM and Chef.Supervises all non-supervisory service employees.Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws.Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and coaching employees; addressing complaints and resolving problems.Requirements:3-5 years of management experience in hospitality or similar industry.Bachelor's degree in Hospitality, Restaurant, or Culinary Management is preferred.Excellent interpersonal communication skills, problem-solving skills, and organizational ability.Passion for creating and personalizing guest experiences.Food Handler Certification (if applicable).Flexible schedule, able to work evenings, weekends, and holidays when needed.",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613817628",
  "title": "Operations Associate",
  "company": "Bird",
  "place": "Santa Monica, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/operations-associate-at-bird-2613817628?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=T%2FDmdtCatc5s4iYf1QL%2BSA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Who Is BirdBird is a global team guided by a shared vision: to make cities more livable through safe, sustainable electric mobility. From our first e-scooter ride in 2017 to the thousands of rides taking place every day, our passionate team and award winning custom vehicles have helped riders complete hundreds of millions of carbon-free trips in more than 150 cities around the world. And we're just getting started.Bird’s Community Operations team facilitates operational excellence by providing customers world-class experiences, providing critical insights to cross-functional stakeholders, and driving strategic and new initiatives forward. The team stays focused on aligning the highest-level company priorities with effective day-to-day operations, and helping identify and evolve early market signs into future strategic initiatives.The team is seeking a highly-driven, team-oriented, and analytical associate with a bias toward action and impact. The role will oversee BPO sites’ operations covering multiple languages and countries. This role will ensure consistent delivery of key performance metrics related to production, quality (CSAT), and required service level agreements (SLAs). This is a highly cross-functional opportunity to work with city operations, product, systems and business analytics teams to strengthen standard operating procedures, ongoing training, schedules, and staffing.ResponsibilitiesBuild and implement operational processes that deliver scalable solutionsAnalyze key business drivers, trends, and operational metrics to inform improvement strategy and project designMonitoring vendor performance across relevant KPIs and conduct deep-dive investigations to understand the “why” behind how metrics are performingLeverage business tools such Zendesk and/or technical add-ons to identify and remove performance barriersEnsure BPO and contractor agent teams are executing operational strategies to assure compliance with SLAs across all supported lines of businessLead daily and weekly performance reviews and communication with BPO/Contractor teams Work with senior leadership to align staff schedules with defined strategiesWork with Business Analytics team to further create and define key performance indicators (KPI’s) and methodologies to improve and maintain customer experiencePresent analyses and lead discussion with cross-functional stakeholders to senior leadershipRequirementsBA/BS in Business or other related major or equivalent relevant work experience required3+ years experience outsourcing strategy and implementation. Ideally experience in managing and coaching BPO and contractor agent teamsStrong communication, organization and stakeholder management skillsExcel modeling skills and PowerPoint presentation skillsAble to work across cultures effectively, valuing diversity within a virtual teamWilling and eager to roll up sleeves and get to know the business detail-orientedPreferred QualificationDemonstrated ability to deliver results in a fast-paced environmentExperience in the media, digital and/or tech industriesExperience with Zendesk and SQLBilingual or Multilingual is a plusGrowth mindset: seek out learning opportunities for yourself and the teamCulture at BirdWe're an ambitious, smart and open-minded team that is passionate about our mission. Each day is unlike the last, as we’re constantly moving forward, challenging each other, and working together to create the future of micro-mobility.Perks upWe want people to succeed at Bird, so we give our teams plenty of time off to relax and recharge. We also offer a generous employer-paid healthcare coverage, on-demand doctor visits, childcare support, a pre-tax commuter account for mass transit or parking, a wellness stipend, and more.Bird is the worldBird stands for a culture of inclusion. We celebrate different backgrounds, experiences, and perspectives —encouraging everyone to bring their authentic selves to work. We have a diverse environment that empowers our team to feel comfortable when they voice their opinions. For these reasons and more Bird is a proud equal employment opportunity employer. We welcome everyone regardless of their race, color, religion, sex, national origin, age, disability, veteran status, or genetics, and we are dedicated to providing an inclusive, open, and diverse work environment.Sound like a place you’d like to work? Sweet. Let’s chat.",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Computer Software, Internet, and Financial Services"
 },
 {
  "job_id": "2613850781",
  "title": "Online Marketing Specialist",
  "company": "Wish",
  "place": "San Francisco, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/online-marketing-specialist-at-wish-2613850781?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=aoG9QxwvOg%2FVaXHbfiNU0A%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Company DescriptionWish is a mobile e-commerce platform that flips traditional shopping on its head. We connect hundreds of millions of people with the widest selection of delightful, surprising, and—most importantly—affordable products delivered directly to their doors. Each day on Wish, millions of customers in more than 160 countries around the world discover new products. For our over 1 million merchant partners, anyone with a good idea and a mobile phone can instantly tap into a global market.We're fueled by creating unique products and experiences that give people access to a new type of commerce, where all are welcome. If you’ve been searching for a supportive environment to chase your curiosity and use data to investigate the questions that matter most to you, this is the place.Job DescriptionManage daily guest list for influencers to come onsiteConduct outreach and curate relationships with new influencersTrack social media trends & proactive pitching of opportunitiesPrepare weekly social media performance reporting and recaps for internal useFollowing up with influencers to ensure content guidelines are metWorking proactively to think about the guest experience (and any potential watchouts), as we roll new experiences, partnerships, and offerings (Getting ahead of questions and issues).Creative fun events around social campaigns and surprise & delight moments for guests.Manage social media accounts (posting stories, recap of events, announcements, etc).QualificationsExperience managing social media campaigns that incorporate live eventsHands on experience managing Influencer marketing campaignsKeen focus on company objectives and deliverablesAbility to maintain objectivity and discretion at all times even when interacting with high profile individualsSignificant live event experience including but not limited to large scale party planning and small event managementAbove all else, candidates must operate on behalf of our client company at all times and NOT try to leverage the company’s branding efforts to build their own brand.Additional InformationWish values diversity and is committed to creating an inclusive work environment. We provide equal employment opportunity for all applicants and employees. We do not discriminate based on any legally-protected class or characteristic. Employment decisions are made based on qualifications, merit, and business needs. If you need assistance or accommodation due to a disability, please let your recruiter know. For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records.Individuals applying for positions at Wish, including California residents, can see our privacy policy here.",
  "job_function": "Marketing",
  "employment_type": "Full-time",
  "industries": "Computer Software, Internet, and Consumer Goods"
 },
 {
  "job_id": "2613815601",
  "title": "Vice President, Program Management",
  "company": "Univision Communications Inc.",
  "place": "Miami-Fort Lauderdale Area",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/vice-president-program-management-at-univision-communications-inc-2613815601?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=GHxPoAKH1MrMWJTJm3FjOA%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Position SummaryUnivision Communications, Inc is seeking a Vice President, Program Management with experience in managing complex programs and projects in large scale consumer services to ultimately drive digital experiences that empower and entertain the Hispanic community.Job ResponsibilitiesThe mission of the Vice President, Program Management at Univision will be to establish, maintain and drive an agile practice which enables high quality, predictable and efficient project management and delivery for our video streaming offerings on web, mobile apps and connected devices.You will establish visibility, tracking, milestones for major integrations which contribute to the overall streaming effort. This includes aspects of various technology partner integrations and other internal assets that will be integrated.You will work cross functionally to drive company goals, be relentless about the details, and be ready to present to executive leadership on status, at a moment’s notice. Fluency in the schedule will be paramount.You will lead with confidence, conviction, diligence and by example.This role reports directly to the EVP Product and Engineering for Univision.Desired Skills& Experience15+ years’ experience driving programs and process at digital companies.You are obsessed with the milestones and the details that fuel them.You are a proven program leader, with strong opinions and conviction on process.You are fearless in taking on issues, challenges and people, striving for the best outcome for the business.You have a reputation for attracting and recruiting top talent.You have a demonstrable track record of leading organizations through growth inflections and transformations.You have a hands-on approach to program management, process, ceremonies and roadmaps.You have the presence and experience necessary to influence and partner with senior level audiences and comfort with Boards and C-level executives.You possess unquestionable integrity, credibility, and character.Eligibility RequirementsMust be willing to work from offices in either Miami, FL; New York, NY; or Los Angeles, CA.Employment/education will be verified.Applicants must be currently authorized to work in the United States on a full-time basis.Univision is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.",
  "job_function": "Project Management and Information Technology",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Information Technology and Services, and Online Media"
 },
 {
  "job_id": "2613869939",
  "title": "Customer Success Manager",
  "company": "Carrot Fertility",
  "place": "United States",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/customer-success-manager-at-carrot-fertility-2613869939?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=HZIF8Nstky6iLO4r1z3NWw%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "About CarrotCarrot Fertility is the leading global fertility benefits provider for employers built to make fertility care and family-forming affordable and accessible for everyone who wants or needs it. Companies use Carrot to customize a fertility benefit that provides employees financial, medical, and emotional support as they pursue parenthood, reducing healthcare costs and resulting in better clinical outcomes.The RoleCarrot is seeking a Customer Success Manager to support Carrot’s existing customers aligned with the small business segment to drive retention, increase member engagement, and maintain high levels of customer satisfaction. The Customer Success Manager acts as a trusted advisor to HR benefits leaders, helps communicate the value of the Carrot product, and responds to customer needs, questions and requests.The TeamThe small business segment is a pooled business model to support customers. The role reports to the Customer Success Team lead.Minimum QualificationsBachelor’s degree2-3 years of experience in customer success, customer support, or account management in a high-growth, technology environmentEnthusiasm for Carrot Fertility’s mission and eagerness to become a part of our collaborative, friendly, and dynamic teamPreferred QualificationsExperience with Salesforce or other CRM Some familiarity with Carrot’s buyers (HR benefits leaders) is preferred, but not requiredDetail-oriented with strong analytical, writing, and communication skillsComfortable working in an ambiguous environment; organized, diligent, and self-motivatedProcess-oriented with an automation/efficiency mindset; experience developing best practices, creating scalable systems and automating routine processesAbility to adopt a continuous improvement mindset and actively contribute to the processes and procedures of the Customer Success teamWhy Carrot?Founded in 2016, CB Insights recognized Carrot as one of the world's most promising private digital health companies. In 2020, Carrot was named to Fast Company’s World Changing Ideas awards program, which recognizes companies that are tackling society's biggest problems, and Carrot was named to Fierce Healthcare’s Fierce 15 List of 2021 which recognizes the most promising healthcare companies in the industry. Carrot supports 200 companies in more than 50 countries across North America, Asia, Europe, South America, and the Middle East",
  "job_function": "Customer Service and Information Technology",
  "employment_type": "Full-time",
  "industries": "Internet, Financial Services, and Hospital & Health Care"
 },
 {
  "job_id": "2613780946",
  "title": "Associate, Center for Sustainability and Economic Performance",
  "company": "Urban Land Institute",
  "place": "Washington, DC",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/associate-center-for-sustainability-and-economic-performance-at-urban-land-institute-2613780946?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=4j3v3XoJQkvV6BENxteOyQ%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Position SummaryThis position plays a key program support and coordination role across the Center for Sustainability and Economic Performance (CSEP). Reporting directly to the Executive Director, CSEP, the Associate will support all CSEP programs, working with the Executive Director to better manage the Center’s program activities calendar, metrics and reporting, event logistics, the program newsletter and websites, and general administrative duties. As needed, they may also be asked to support the center’s content goals, assisting with research, writing, and project coordination to support the center’s activities.Specific ResponsibilitiesSupport the center’s grant reporting and financial management, including processing invoices, tracking program metrics, and helping to review quarterly budget reforecasts.Provide logistical support for sustainability-focused small-scale events, including Advisory Services panels, technical assistance panels, and Sustainability program events and/or convenings.Maintain a program and event calendar for the center.Manage a metrics tracker for center program activities.Assist with outreach and community engagement for district council projects.Work with the Executive Director and team leaders to schedule conference calls and meetings as needed.Provide as-needed research in support of center publications, articles, and event content.Manage the publication of a monthly center e-newsletter and updates to the center websites, in coordination with the team.ExperienceA minimum of one year’s experience in a project coordination or administrative role with some project coordination responsibilities.Experience planning and managing small-scale events, preferably in a professional setting.Experience with Outlook and Microsoft Excel.Demonstrated project management or coordination skills, preferably in a professional setting.Demonstrated research and writing skills.Proficiency with Microsoft Suite, experience with web design/WordPress and graphic design/InDesign a plus.Experience in research, education, and outreach projects.Outstanding organization skills, and the ability to manage several projects simultaneously.Interest in sustainability topics and real estate a plus.Experience in nonprofit organizations helpful.EducationBachelor’s degree preferred and/or relevant work experienceApplication InstructionsTo apply, please follow the link below. Please submit a résumé and letter of interest.ULI is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.EOE/m/f/d/v. No relocation reimbursement is offered at this time.SDL2019-32",
  "job_function": "Other",
  "employment_type": "Full-time",
  "industries": "Nonprofit Organization Management, Higher Education, and Fund-Raising"
 },
 {
  "job_id": "2613811157",
  "title": "Operations Specialist",
  "company": "Waste Management",
  "place": "Morrisville, NC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/operations-specialist-at-waste-management-2613811157?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=um5nI2vIJVIGJ24u2OVQug%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Pay Range- $16.00 - $18.00 per hour based on relevant experience Work Schedule- 8am-5pm M-F What is the Value of a WM Job? The value of a WM job is more than a paycheck. We are Committed to your Growth : 100% tuition paid for you and your family We are People First : We foster an environment where all teammates feel welcomed, valued and seen We are Stable: Our employees are home every day and perform essential and meaningful work We are Investing in You: Amazing Medical, Dental & Vision, 401k with match, Discounted Stock options, Dependent Day Care, and more! #WeAreWM #WMCareers Equal Opportunity Employer: Minority/Female/Disability/VeteranWaste Management (WM), a Fortune 250 company, is the leading provider of comprehensive waste and environmental services in North America. We are strongly committed to a foundation of operating excellence, professionalism and financial strength. WM serves nearly 25 million customers in residential, commercial, industrial and municipal markets throughout North America through a network of collection operations, transfer stations, landfills, recycling facilities and waste-based energy production projects.I. Job SummaryProvides clerical and administrative support to departmental Managers, and assists in coordinating all aspects of daily operations, including recording and reporting data.II. Essential Duties And ResponsibilitiesTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Other minor duties may be assigned. Assists in troubleshooting and resolving safety, service, and operational issues. Creates, distributes, and closes-out customer tickets on a daily basis. Maintains and distributes department related information on a daily basis. Communicates with other supervisors and managers about operations and/or dispatch issues. Completes and maintains a variety of reports as directed by the department manager. Uses software tools to manage a variety of tasks, such as procurement, time and attendance, safety incidents, and contract labor. Assists with data collection and reporting required for incentive pay programs. Assists with the processing of payments and other financial tasks as necessary. Assists in the implementation of operational projects as needed. Communicates with customers about service issues as needed. Communicates with employees about scheduling and work assignments as needed. May enter and maintain Service Machine SMART data on a daily basis. Performs other duties as assigned. III. Supervisory ResponsibilitiesThis job has no supervisory duties.IV. QualificationsThe requirements listed below are representative of the qualifications necessary to perform the job. Education and Experience Education: High school diploma or G.E.D (accredited) Experience: Zero (0) to four (4) years previous experience (in addition to education requirements) Certificates, Licenses, Registrations or Other Requirements None required. Other Knowledge, Skills or Abilities Required None required. BenefitsAt Waste Management, each eligible employee receives a competitive total compensation package including Medical, Dental, Vision, Life Insurance and Short Term Disability. As well as a Stock Purchase Plan, Company match on 401K, and more! Our employees also receive Paid Vacation, Holidays, and Personal Days. Please note that benefits may vary by site.If this sounds like the opportunity that you have been looking for, please click \"Apply.”Primary LocationUnited States-North Carolina-MorrisvilleFlexible Work Location AcceptableNoShiftDayTravelNoFLSA StatusNon-exemptJobOperations",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Construction, Staffing and Recruiting, and Transportation/Trucking/Railroad"
 },
 {
  "job_id": "2613789827",
  "title": "Operations Assistant",
  "company": "CCS Fundraising",
  "place": "Chicago, IL",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/operations-assistant-at-ccs-fundraising-2613789827?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=pvaKWsCWPuN0mZK0ryAFpg%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "About CCS: CCS Fundraising is an international strategic fundraising firm that partners with nonprofits for transformational change. For seven decades, CCS has empowered many of the world’s greatest organizations across sectors to advance some of the most important causes in history. We plan, manage, and implement programs and initiatives that achieve fundraising goals and mission impact. CCS provides tailored support to more than 400 nonprofit organizations annually. Headquartered in New York, the firm has over 250 professionals and more than a dozen offices throughout the United States and Europe. Our people are our greatest strength. At CCS, you will join a diverse team of smart, passionate, and resourceful professionals who are driven by purpose and committed to performance.Job Purpose: CCS Fundraising is seeking a self-motivated, reliable, and detail-oriented Operations Assistant to help support our Central United States leadership team. The Operations Assistant will lead in all scheduling, coordinate travel, process expenses, manage vendor relationships, and offer additional support to the operations team. The ideal candidate is highly resourceful, detail-oriented, professional, and capable of managing a heavy workload and prioritizing tasks in a fast-paced, deadline-driven corporate environment. This is an excellent opportunity to build a career in a mission-driven, growing company with competitive compensation and benefits.ResponsibilitiesManage day-to-day operations of the office, including taking calls, interfacing with clients and CCS personnel, responding to emails and managing office security accessProvide scheduling, travel, and expense processing support to the executive team; areas of focus include:Interfacing with internal and external audiences to schedule meetings and callsManaging the complex calendars of executive team membersMaking travel and hotel reservations; including tracking airline credits and rewards programsPreparing timely expense reports and cash reimbursement requestsParticipating in weekly operations meetings to provide insight on schedules and support the facilitation of next stepsUpload and track key documents and information in company-wide databasesDevelop and sustain a level of professionalism, among staff and clientele, consistent with the firm’s mission and valuesAdditional duties as assignedQualificationsPrior experience providing executive support as an assistant, executive assistant, office manager, or in business development or similarly focused positionProficient in Microsoft Office, with the ability to become familiar with firm-wide specific programs and softwareHigh attention to detailStrong organizational, project management, and problem-solving skillsImpeccable multi-tasking abilitiesSelf-starter able to drive activity in a fast-paced environmentFriendly and professional demeanorExperience with Concur preferredCCS offers a competitive benefits package and is an Equal Opportunity Employer.",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Nonprofit Organization Management, and Management Consulting"
 },
 {
  "job_id": "2613816789",
  "title": "Administrative Assistant - Athletics",
  "company": "Ravenscroft School",
  "place": "Raleigh, NC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/administrative-assistant-athletics-at-ravenscroft-school-2613816789?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=U8OAOAiEWBjNaFpOZvzYog%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Requisition Number: ADMIN01074Schedule: 30 hours/week; work evenings and weekends as neededResponsibilitiesProvide technical support to the Director, coaches and athletic staff.Greet and assist visitors; answer telephone; relay messages.Order and maintain department supplies, copy and fax equipment; coordinate repair calls. Sort and distribute mail.Prepare and post campus weekly schedule; notify appropriate parties of changes.Coordinate requests for maintenance repairs.Confirm weekly games and officials.Update Athletic HotLine.Maintain facility calendar for PE & Athletics. Coordinate request for Finley Center Facilities.Assist with website updates.Attend athletic events as scheduled with the Assistant Athletic Director.Coordinate schedules with booking agents; maintain contact information for agents.Write checks for officials; send report to the Business Office or process payment through Arbiter.Compile and distribute team rosters.Coordinate sports photographs.Coordinate out-of-town athletic events; secure rooms; collect funds for room rentals; prepare control sheet and deposit information; arrange for transportation.Prepare and publish practice schedules for the winter season. Prepare and publish inclement weather practice schedules for fall and spring seasons.Order and distribute coaches gearCoordinate, schedule and assign all transportation needs for school.Check in all orders and send a copy of items received to accounting.Work evenings and weekends as needed.The above description covers the most significant duties performed, but does not exclude assignments not mentioned.QualificationsMust have excellent communication and computer skills; tact in dealing with people at all levels. Good face/name memory capacity. Detail-oriented. Professional image and presentation. Willingness to cooperate with other departments; accept additional job duties as assigned. Sensitivity in dealing with teacher, student, parent needs. Ability to prioritize and self-direct. Flexibility in work schedule, as needed. Accuracy is a must. College degree or equivalent education and/or experience required. Must be able to meet physical requirements of the position.SDL2019-256",
  "job_function": "Administrative",
  "employment_type": "Part-time",
  "industries": "Primary/Secondary Education, Higher Education, and Education Management"
 },
 {
  "job_id": "2613769226",
  "title": "Economist",
  "company": "U.S. Department of the Treasury",
  "place": "New York, NY",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/economist-at-u-s-department-of-the-treasury-2613769226?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=Hd4RXfEKrARTJh7qugdJ%2Bw%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Overview Accepting applications Open & closing datesOpening and closing dates06/14/2021 to 06/25/2021 ServiceCompetitive Pay scale & gradeGS 14 Salary$120,755 to $172,500 per year Appointment typePermanent Work scheduleFull-time DutiesSummaryClick on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information.WHERE CAN I FIND OUT MORE ABOUT OTHER IRS CAREERS? Visit us on the web at .ResponsibilitiesWHAT IS THE LARG BUSINESS & INTERNATIONALDIVISION?A description of the business units can be found at:The following are the duties of this position at the full working level. If you are selected at a lower grade level, you will have the opportunity to learn to perform these duties and will receive training to help you grow in this position.Assumes responsibility for the initiation, planning, implementation, control, modification, and execution of all or part of a research project or assignment, including such tasks as specification of the methodology to be used, and preparation of appropriate procedures, specifications, and materials needed for assuring the adequacy of the study's design.Assumes full technical responsibility for interpretation and application of findings.Reviews economic, statistical, and subject-matter literature for data and research methodology appropriate for inclusion in the research, and to evaluate the reasonableness of the APMA, taxpayer, and foreign tax jurisdiction positions.Performs an in-depth review and analysis for reasonableness and accuracy of all material produced for a given study.Research generally involves the use of multiple sources and/or databases.Travel RequiredOccasional travel - You may be expected to travel for this position.Supervisory statusNoPromotion Potential14RequirementsConditions of Employment We may select from this announcement or any other source to fill one or more vacancies. Additional jobs may be filled. The salary range indicated in this announcement reflects the minimum locality pay up to maximum locality pay for all duty locations listed. The range will be adjusted for selected duty location. General Schedule locality pay tables may be found under Salaries & Wages . Must be a U.S. Citizen or National. A 1-year probationary period is required. Have your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer. Undergo an income tax verification and review of prior performance/conduct. Must successfully complete a background investigation, including a FBI criminal history record check (fingerprint check). Complete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agency. If you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so. Go through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9 . Federal law requires verification of the identity and employment eligibility of all new hires in the U.S. These documents must be unexpiredoriginal or certified copies. Provide proof of U.S. Citizenship. (Birth certificate showing birth in the U.S; Unexpired U.S. Passport; Certificate of Citizenship or Naturalization; or Report of Birth Abroad of a U.S. Citizen (Form FS-240)) Relocation expenses - No Obtain and use a Government-issued charge card for business-related travel.QualificationsFederal experience is not required. The experience may have been gained in the public sector, private sector or Volunteer Service. One year of experience refers to full-time work; part-timework is considered on a prorated basis. To ensure full credit for your work experience, please indicate dates of employment by month/year, and indicate number of hours worked per week, on your resume.You must meet the following requirements by the closing date of this announcement:BASIC REQUIREMENT : You must have a Bachelor's or higher degree in economics from an accredited college or university, that included at least 21 semester hours in economics and 3 semester hours in statistics, accounting, or calculusORA combination of education and experience. The education must include courses equivalent to a major in economics, as shown above, plus appropriate experience or additional education.In Addition To Meeting The Basic Requirement Above, To Qualify For This Position You Must Also Meet The Qualification Requirements Listed BelowSPECIALIZED EXPERIENCE GS-14 LEVEL: Applicants must have one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-13 level in the Federal Service. Examples of specialized experience includes: Application of methods and techniques utilizing economic factors related to transfer pricing and transfers of tangible and intangible property, high value services, risk allocation and transfer pricing of foreign controlled corporations; and Development and analysis of transfer pricing factual information to recognize and evaluate significant and critical factors, solve complex problems, conduct comparability analyses, draw rational economic conclusions, prepare comprehensive reports; and an In-depth knowledge of the provisions of the Internal Revenue Code Sec. 482 sufficient to interpret data secured from tax returns and to understand sections applicable to assigned cases; and Expertise in written and oral communications to explain and defend transfer pricing related research findings, hold conferences with taxpayers and their representatives and maintain professional relationship and serves where necessary as a qualified witness for the government in litigation cases.For more information on qualifications please refer to OPM's Qualifications Standards .EducationEDUCATION DOCUMENTATIONFor positions with an education requirement, or if you are qualifying for this position by substituting education or training for experience, submit a copy of your transcripts or equivalent. An official transcript will be required if you are selected.A college or university degree generally must be from an accredited (or pre-accredited) college or university recognized by the U.S. Department of Education. For a list of schools which meet these criteria, please refer to Department of Education Accreditation page .If you are qualifying based on foreign education, you must submit proof of creditability of education as evaluated by a credentialing agency. Refer to the OPM instructions.Additional informationPositions are located in LB&I, LB&I Deputy Commissioner, Dir Trty & Trans Pric Ops, Director Apma. Positions can be filled in any of the following locations:Washington, DC New York, NYChicago, ILSan Francisco, CASan Jose, CALos Angeles, CALaguna Niguel, CAOther Information This is a Bargaining unit position. Tour of Duty: Monday-Friday 8:00 a.m.-4:30 p.m. Alternative work schedule, staggered work hours or telework may be available. If you are in a telework eligible position, you may be directed to temporarily telework on a full-time basis due to COVID 19. Employees must be within a 150-mile radius of their official assigned post-of-duty (POD) while in a telework status. Once normal operations resume, employees may be directed back to the office to perform the duties of their position. Telework eligibility does not guarantee telework; employees must meet and sustain IRS telework eligibility requirements and supervisor's approval to participate in the IRS Telework Program. As a reminder - If you are selected for a position, you are responsible for reporting to your designated POD (location) on the negotiated start date or as directed by management.How You Will Be EvaluatedYou will be evaluated for this job based on how well you meet the qualifications above.Your application includes your resume, responses to the online questions, and required supporting documents. Please be sure that your resume includes detailed information to support your qualifications for this position; failure to provide sufficient evidence in your resume may result in a \"not qualified\" determination.Rating: This position will be filled through the Direct Hire Authority. Under this authority, competitive rating, ranking, and veterans' preference procedures do not apply. Your application will be considered based on education, training, and quality of your experience. For more information on Direct-Hire Authority visit: OPM Direct Hire Fact Sheet .Referral: Applicants who meet the basic qualification requirements may be referred to a selecting official for consideration. Candidates may be required to participate in a selection interview (telephonic and/or in person at the discretion of the Selecting Official in accordance with hiring practices). We will not reimburse costs related to the interview such as travel to and from the interview site.If you are a displaced or surplus Federal employee (eligible for the Career Transition Assistance Plan (CTAP)/Interagency Career Transition Assistance Plan (ICTAP) , you must be rated as \"highly qualified\" to receive special selection priority.Background checks and security clearanceSecurity clearanceNot RequiredDrug test requiredNoPositionsensitivity and riskModerate Risk (MR)Trust determination processSuitability/FitnessThis job is open toThe publicU.S. citizens, nationals or those who owe allegiance to the U.S. Clarification from the agencyOpen to U.S. Citizens/Nationals",
  "job_function": "Finance and Sales",
  "employment_type": "Part-time",
  "industries": "Insurance, Government Administration, and Financial Services"
 },
 {
  "job_id": "2613817496",
  "title": "Communications Specialist – Department of Public Health and Environment",
  "company": "City and County of Denver",
  "place": "Denver, CO",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/communications-specialist-%E2%80%93-department-of-public-health-and-environment-at-city-and-county-of-denver-2613817496?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=NsE1XtERVWJEwgs%2BfG0jOw%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "About Our JobWe encourage you to apply as soon as possible because this posting may close without advanced notice.Denver's Department of Public Health and Environment (DDPHE) is dedicated to advancing Denver's environmental and public health goals. DDPHE works collaboratively with city, state and community partners to conduct education, community engagement, and enforcement to promote healthy people, healthy pets, and a sustainable environment. DDPHE oversees a number of services related to public health and the environment and is comprised of six divisions: the Division of Administration; Community & Behavioral Health; Public Health Investigations; Denver Animal Protection; the Office of Medical Examiner; and Environmental Quality. For more information on DDPHE’s programs and services, visit the DDPHE website at: Denver Department of Public Health and Environment .The Division of Administration (ADMIN) provides overall policy direction, management, communications, and core services for the Department of Environmental Health. The Office manages departmental purchasing and budget, performance management, and community outreach and engagement. ADMIN also manages the City’s contract with Denver Health for a number of public health and administrative services provided between the two organizations.The Division of Administration has an opening for a Communications Specialist. In our Communications Specialist we are looking for a team player and strategic communicator. This position will work directly with DDPHE divisions to develop strategic communication plans, develop key messaging, update social media and communicate with stakeholders. This position will also handle day-to-day media relations including researching issues, interviewing and preparing subject matter experts as well as crisis communications. The Communications Specialist will report to the Director of Communications and Marketing and will be a vital part of the Communications team, effectively communicating news from all divisions to the appropriate audiences and helping to elevate the brand of DDPHE.Job Dutiesand responsibilities of this position include, but are not limited to, the following:Collaborate with DDPHE staff to produce a variety of communication pieces (press releases, speeches and message points, reports, presentations, fact sheets, etc.), digital content and/or develop strategies for enhanced PR with target audiences and distribute that information to internal and external audiences through a variety of communication channelsDevelop and implement communication strategies for social media and other digital assets; monitor and respond to social media on a daily basisOversee the preparation and distribution of responses to media requests, informational interviews, public inquires via email, letters or social media and/or public official requests, and ensures accuracy and timelinessPitch stories to media locally and nationally and build relationships with key reportersAct as spokesperson and represent DDPHE by relaying information and promoting publicity for public and media related initiativesDevelop, coordinate, and implement special events Effectively coordinate the development, design, approval, production, and distribution of marketing materials in partnership with internal and external design vendors/communications teams Along with all department staff, this position will actively participate on an emergency preparedness and response team to support DDPHE’s responsibilities outlined in the City’s Emergency Operations Plan. This may require being ‘on-call’ from time to time to help respond to emergencies. Additional training commensurate with assigned duties will be provided.Other duties as assignedAbout YouOur Ideal Candidate Will HaveExperience writing a variety of communication pieces including press releases, web content andprofessional reportsProven track record of generating earned media and acting as an organizational spokespersonExperience developing successful social media campaigns in a professional settingDemonstrated ability developing marketing plans and campaignsExperience working in government, public health or heath care organizationsQualificationsWe realize your time is valuable so please do not apply if you do not have at least the following required minimum qualificationsEducation requirement: Bachelor's Degree in Business Administration, Marketing, Communications or a related field.Experience Requirement: Three (3) years of full performance, professional level experience performing marketing and/or public relations functions including research and analysis, developing public announcements and publications, and developing marketing and/or public relations strategies.Education/Experience Equivalency: One (1) year of the appropriate type and level of experience may be substituted for each required year of post-high school education.Additional appropriate education may be substituted for the minimum experience requirements.License/Certifications: None.To Be Considered For This Position, You Must Include The Following On Your Job Application (upload The Attachment(s) To The Resume/CV Section On The My Experience Tab)ResumeCover letterAbout Everything ElseJob ProfileCA2840 Marketing and Communications SpecialistTo view the full job profile including position specifications, physical demands, and probationary period, click here .PositionTypeUnlimitedPositionSalary Range$77,174.00 - $127,337.00Starting Pay$77,174 - $84,000 per yearAgencyDept of Public Health & Environment The City and County of Denver provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, national origin, disability, genetic information, age, or any other status protected under federal, state, and/or local law. For information about right to work, click here for English or here for Spanish.",
  "job_function": "Marketing, Public Relations, and Writing/Editing",
  "employment_type": "Full-time",
  "industries": "Construction, Nonprofit Organization Management, and Government Administration"
 },
 {
  "job_id": "2613797008",
  "title": "Customer Collaborative Planning and Engagement Lead",
  "company": "SCIP Consulting",
  "place": "United States",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/customer-collaborative-planning-and-engagement-lead-at-scip-consulting-2613797008?refId=Gpj3iJck3gBOpAxKefhtmQ%3D%3D&trackingId=OZ7ePNkO8As%2Fj%2FZ7uYYUUQ%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Please apply only if you are open to contract opportunities.One of our clients is looking for a Customer Collaborative and Engagement lead who will work with key business partners and Distributors to enable customer success and value realization for the client. The key role will be to develop trusted relationships with customer Partners and develop plans/roadmap for demand pipeline, deals, and inventory position to help drive the business's success. It would be essential for this role to collaborate cross-functionally within the client organization and bring the voice of the customer, balancing both client’s & business partner’s needs, future growth, and strategic goal alignment. Additionally, the individual will collaborate with commercial, fulfillment, and planning organizations to ensure optimal allocation and maximize on-time delivery to customers.",
  "job_function": "",
  "employment_type": "Contract",
  "industries": ""
 },
 {
  "job_id": "2613816832",
  "title": "Research Associate",
  "company": "Harvard University",
  "place": "Boston, MA",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/research-associate-at-harvard-university-2613816832?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=oNkG2w1EItCN17Drsh%2B9lg%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job-Specific ResponsibilitiesThe Harvard Business School seeks a Research Associate to assist in delivering the first year MBA course, The Entrepreneurial Manager (TEM). The course is well-liked by students and is taught by a group of dedicated faculty who bring a range of academic and professional experiences to the topic of entrepreneurship. The course invites 900+ students to learn how to lead amidst extreme uncertainties. A curious and talented RA will help make TEM even more effective with students at a time of great opportunity and looming questions for entrepreneurs in the U.S. and around the world.The RA will engage with the course faculty on course development, content creation, and execution. This work will cover a range of core subjects, including: the design and development of new business models; financing entrepreneurial ventures; the hiring and management of people at early stage ventures, and scaling startup firms.These Include, In Partnership With The Faculty Teaching GroupThe RA will collaborate on several activities to support the delivery of a highly successful case-based course.Writing and updating Harvard Business School cases on entrepreneurial ventures, which serve as the centerpiece of the course;Creating teaching notes and other teaching materials related to these cases, drawing on key lessons from these episodes and core findings in the academic literature;Synthesizing key concepts from scholarship in economics, sociology, history, and other disciplines that touch on entrepreneurship in ways that make them accessible to a wide range of students;Developing quantitative exercises, primarily based in Excel, to help students learn the tools and techniques of entrepreneurial finance and of measuring and monitoring inside new firms;Researching and sharing timely developments in entrepreneurship that may shed new insight into individual cases or the course as a whole; andPreparing and assessing assignments, exams, and other course tools.Other duties as assigned.They RA may provide tutorial support to students outside the classroom.The RA will attend all faculty teaching-group meetings.Ideal candidates will be comfortable in an environment that requires an exacting level of quality and intellectual rigor. They will enjoy collaborating with HBS faculty. They will be keenly interested in the topic of entrepreneurship; they may bring outside experience or academic interest to the subject. They will believe in the potential that outstanding teaching brings to a course and the partnership that engaged students and dedicated teachers share in the classroom.Basic QualificationsAdvanced degree or bachelor’s degree with significant years of relevant work experience.MBA, MS in Finance, or Ph.D. level work can be helpful.Additional Qualifications And SkillsEvidence of academic excellence and careful, skillful writing is required. 2-4 years of relevant work experience is desired. The successful candidate must have a strong quantitative background and experience creating or extensive experience using technical tools such that they could develop them for others; have solid financial, analytical, conceptual skills; work well independently; and be at home in an academic environment. Excellent communication, interpersonal, organization, research, writing, and editing skills are required. Successful candidates will demonstrate a proven ability to handle multiple projects simultaneously and to flexibly adapt to changes in priorities; to work calmly under deadline pressure; to work both independently and as a team member; to take initiative; and to follow projects through to completion. All positions will be given a writing exam. The ability to read academic, subject-specific information and write a reasoned and thoughtful analysis or produce a synthesized interpretation, is necessary. Diplomacy, integrity, and judgement are a must.Additional InformationThis is a half-time appointment starting this summer (start date flexible) through June 30, 2022 with potential for reappointment. All HBS RA roles are structured as one-year term appointments with potential for renewal.Applications will be considered on a rolling basis, a cover letter and resume are required for full consideration. Upon the review of application materials, applicants may be asked to submit a writing sample, and transcript(s). All positions will be given a writing exam.Harvard Business School does not offer visa sponsorship for this opportunity.While we continue to monitor the evolving COVID-19 guidelines and restrictions, we appreciate your understanding and flexibility with our interview process. Please note that we will be conducting interviews virtually (phone and or Zoom) for selected candidates until further notice.Culture of Inclusion: The work and well-being of HBS is profoundly strengthened by the diversity of our network and our differences in background, culture, national origin, religion, sexual orientation, and life experiences. Explore HBS work culture.Job FunctionResearchLocationUSA - MA - BostonJob CodeRS0056 Researcher II HumanitiesSub-UnitDepartmentDivision of Research and Faculty DevelopmentTime StatusPart-time Salary Grade 056Union00 - Non Union, Exempt or TemporaryAppointment End Date30-Jun-2022Pre-Employment ScreeningEducation, IdentityEEO StatementWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, gender identity, sexual orientation, pregnancy and pregnancy-related conditions, or any other characteristic protected by law.",
  "job_function": "Research, Analyst, and Information Technology",
  "employment_type": "Part-time",
  "industries": "Nonprofit Organization Management, Financial Services, and Hospital & Health Care"
 },
 {
  "job_id": "2613788444",
  "title": "Marketing Coordinator",
  "company": "Artisanal Brewing Ventures",
  "place": "Charlotte, NC",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/marketing-coordinator-at-artisanal-brewing-ventures-2613788444?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=4asksCmvhOj7XOHAg78jSw%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Marketing CoordinatorPosition SummaryThe Marketing Coordinator is responsible for assisting the brand teams in implementing key marketing programming and brand deliverables via social content and brand marketing support.Key Responsibilities Assisting in the creation of monthly brand social calendars across platforms to bring brand persona to life and support marketing calendar. Execution and scheduling of monthly content, including plans to capture message/targeting testing. Data collection and monthly reporting for campaigns and social efforts. Assistance in creating sales materials and program support tools Program and media execution support such as sampling distribution, consumer surprise and delight fulfillment and other needs. Consumer engagement and monitoring across social pages. Additional support to analyze effectiveness of consumer programs utilizing internal and external data and partnering with ABM to make recommendations to modify elements or changes in strategic direction. Perform other business-related duties as assigned. Key Competencies People Agility - Uses a high interpersonal effectiveness and effective written and verbal communication, along with a consistent and positive energy, to gain trust and support across the team.Agile Learning - A curious learner who quickly assesses complex problems, seeing the big picture and adapting past experiences to new situations, to create opportunities and overcome challenges.Motivation & Tenacity - Self-starter who knows how to prioritize multiple projects to get things done at a high level.Results Orientation - Displays drive and initiative and focused on delivering the desired outcomes, but getting there through teamwork, collaboration, and aligning to ABV values.Collaborate - Works cooperatively with others across the organization to achieve shared objectives. Represents own interests while being fair to others and other areas. Partners with other to get work done. Credits others for their contributions and accomplishments. Gains trust and support of others.Position Requirements Bachelor’s degree or some College preferred Approximately 1 year of related/relevant experience required Proficient in Excel & PowerPoint Highly proficient as a social media user Design, photography, and/or copywriting experience is preferred Beer/Adult Beverage experience is not a requirement DisclaimerThis Job Description is only a summary of the typical functions of the job, not an exhaustive or comprehensive list of all possible job responsibilities, tasks and duties.Artisanal Brewing Ventures is an Equal Opportunity Employer",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Food & Beverages, Food Production, and Consumer Goods"
 },
 {
  "job_id": "2613835046",
  "title": "Southeast Asia Administrator",
  "company": "University of North Carolina at Chapel Hill",
  "place": "Chapel Hill, NC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/southeast-asia-administrator-at-university-of-north-carolina-at-chapel-hill-2613835046?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=xV%2FeVkn8OKLRNHfYPGaEkw%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Posting DetailsPositionType Temporary Staff (SHRA)Job TitleSoutheast Asia AdministratorDepartment Name Carolina Asia Center - 313200Vacancy ID S018003PositionPosting Category Academic AdministrationHiring Range $25.96 - $30.29/per hourFull-time/Part-time Part-Time TemporaryIf part-time, how many hours per week? 20Work ScheduleThree days per weekProposed Start Date 08/02/2021Estimated Duration of Appointment 6 months or lessPosting Open Date 06/22/2021Posting Close Date 06/25/2021DescriptionOf WorkThe Southeast Asia Administrator will assist the Carolina Asia Center in developing the profile of Southeast Asian Studies on the UNC -Chapel Hill campus. The primary task will be preparing major grant applications to support Southeast Asian Studies, with additional duties related to Southeast Asian language instruction, seminar and outreach activity, faculty support, event organization and promotion, and social media engagement.Education And ExperienceMinimum Education and Experience: Bachelor’s degree and one year of experience related to the area of assignment; or equivalent combination of training and experience. All degrees must be received from appropriately accredited institutions.Strongly Preferred Knowledge, Skills, and Abilities: The ideal candidate should have experience with grant writing; a degree with relevance to Southeast Asian studies (at least at the bachelor’s level); and at least two years of experience in a professional capacity related to the field of Southeast Asian studies.Preferred QualificationsThe ideal candidate will have an advanced degree in a field related to Southeast Asian studies; familiarity with Southeast Asian studies programs in a university setting; and demonstrated experience with one or more Southeast Asian language, with field research in Southeast Asia or Southeast Asian diaspora communities or both.Special Physical And Mental RequirementsEqual Opportunity Employer StatementThe University of North Carolina at Chapel Hill is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender, gender expression, gender identity, genetic information, race, national origin, religion, sex, sexual orientation, or status as a protected veteran.Stimulus/ARRA Funded NoSpecial Instructions Temporary Employment PoliciesTemporary Employment PoliciesQuick Link https://unc.peopleadmin.com/postings/194365Office of Human Resources Contact InformationIf you experience any problems accessing the system or have questions about the application process, please contact the Office of Human Resources at (919) 843-2300 or send an email to employment@unc.eduPlease note: The Office of Human Resources will not be able to provide specific updates regarding position or application status.",
  "job_function": "Information Technology",
  "employment_type": "Temporary",
  "industries": "Higher Education, Research, and Hospital & Health Care"
 },
 {
  "job_id": "2613823920",
  "title": "Reservations Coordinator",
  "company": "Hilton",
  "place": "Coronado, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/reservations-coordinator-at-hilton-2613823920?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=qnq9JhKQKtByY9oAZkTvFw%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "As a Reservations Coordinator, you will use your strong technical skills, excellent communication skills, persuasive sales ability and world class customer service to consult with customers and book customized hotel reservations via email/phone.What will I be doing?ResponsibilitiesSpecifically, you would be responsible for performing the following tasks to the highest standardsAs a Reservations Coordinator, you would be responsible for assisting group reservations in the hotel’s continuing effort to deliver outstanding guest service and financial profitability.Answer telephones in a professional, courteous manner with proper greeting and closing, providing personalized guest service.Proactively promote/sell hotel services and offerings to the Hotel’s guests and callers, delivering on revenue expectations.Must have complete knowledge of all dining venues and take reservations for dining with accuracy.Must have current knowledge of all key personnel and departmental functions in the hotel.Operate computers and multiple phone lines. Keep management informed of pertinent guest and personnel issues.Monitor and action systems as assigned to include but not limited to email inboxes, text/chat platforms, interdepartmental communication systems, radio communication, all phone ques, fax machines, etc. Perform any tasks related to communicating and selling to guests or tasks related to the hotel operation as assigned.Attend weekly meeting with GRC and be prepared to discuss the next seven days group arrivals in detail. Ensure all VIP and Contact reservations are annotated as such and have an approximate arrival time.Attend scheduled Pre-Convention meetings. Meet with contact at least once during conference. What are we looking for?Specifically, We Look For Demonstration Of These ValuesSince being founded in 1919, Hilton has been a leader in the hospitality industry. Today, Hilton remains a beacon of innovation, quality, and success. This continued leadership is the result of our Team Members staying true to our Vision, Mission, and Values.Hospitality - We're passionate about delivering exceptional guest experiences.Integrity - We do the right thing, all the time.Leadership - We're leaders in our industry and in our communities.Teamwork - We're team players in everything we do.Ownership - We're the owners of our actions and decisions.Now - We operate with a sense of urgency and disciplineIn addition, we look for the demonstration of the following key attributes:QualityProductivityDependabilityCustomer FocusAdaptabilityWhat will it be like to work for Hilton?Hilton is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Hilton has offered business and leisure travelers the finest in accommodations, service, amenities and value. Hilton is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision “to fill the earth with the light and warmth of hospitality” unites us as a team to create remarkable hospitality experiences around the world every day. And, our amazing Team Members are at the heart of it all!Work LocationsHotel del Coronado, Curio Collection by HiltonScheduleFull-timeBrandCurio Collection by HiltonShiftFull AvailabilityJob LevelTeam MemberJobCall Center and Reservations",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Restaurants, Food & Beverages, and Hospitality"
 },
 {
  "job_id": "2613881689",
  "title": "Financial Analyst",
  "company": "MongoDB",
  "place": "New York, NY",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/financial-analyst-at-mongodb-2613881689?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=Mp0u9%2F75fV9hB7RMa2kwag%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "The database market is massive (the IDC estimates it to be $119B+ by 2025!) and MongoDB is at the head of its disruption. The MongoDB community is transforming industries and empowering developers to build amazing apps that people use every day. We are the leading modern data platform and the first database provider to IPO in over 20 years. Join our team and be at the forefront of innovation and creativity.MongoDB is seeking a Financial Analyst to join the Financial Planning and Analysis (FP&A) team. This position requires an accomplished and analytical financial professional with a demonstrated track record of success in a dynamic, fast-paced environment.You are a successful business partner. You communicate clearly and are able to successfully juggle multiple priorities. You are a driven self-starter who is able to work with senior leadership comfortably, takes tasks from start to finish and someone who enjoys working in a fast-paced, challenging environment. You are responsive and adapt quickly to change, embrace challenges and champion the advancement of analyses, financial planning tools, systems, and controlsAs part of the FP&A team, your responsibilities will include Budget vs. Actual Opex analysis throughout the organization with appropriate commentary and understanding of notable variances Work closely with departments across the organization to understand changes in spend behavior in order to produce the most accurate Opex forecasts Assist in maintaining and enhancing our Adaptive Insights planning tool, with duties including updating headcount forecasts, developing new reports, training stakeholders, and reviewing our implementation to enhance forecasting accuracy and automation capabilities. Develop a deep understanding of the financial impact and ROI of investments made by the organization Identify cost efficiencies and assist our Procurement team with financial analytics to support vendor negotiations and spend forecasts. Analyze and validate variable expenses such as commissions, travel & expense, etc. Partner with the accounting team to ensure accuracy in departmental cost allocations that drive our quarterly external financial statements Assist in the annual budgeting process Assist in preparing quarterly board presentations Work on ad-hoc analysis and requests on a need basis About You 2+ years of relevant experience Strong analytical, critical thinking and quantitative skills Knowledge of corporate finance, financial statements, and basic accounting principles Ability to drive strategic direction through insightful analysis Ability to collaborate with different teams throughout the organization Flexibility (open to change) and ability to learn on the fly Drive for results & high sense of urgency Attention to detail Excellent oral and written communication skills Experience in Adaptive Insights or any other FP&A software tool is a big plus Experience with financial modeling and proficiency in Excel Demonstrated ability to roll-up your sleeves and work with team members, driving projects through to completion You are passionate about technology and problem solving What does success look like? ResponsibilitiesThe financial analyst, FP&A will be successful in this role when they can start executing the following strategic tasks/responsibilities after their first quarter with the company Develop a strong understanding of the key spend categories within the different departments across the organization and their budget vs actuals variances Learn to navigate around our ERP and FP&A systems (Netsuite, Adaptive and Concur) Identify initial areas for improvement within our opex forecasting and Adaptive Insights automation capabilities Provide proactive analytical support and establish strong working relationships with stakeholders To drive the personal growth and business impact of our employees, we’re committed to developing a supportive and enriching culture for everyone. From employee affinity groups, to fertility assistance and a generous parental leave policy, we value our employees’ wellbeing and want to support them along every step of their professional and personal journeys. Learn more about what it’s like to work at MongoDB, and help us make an impact on the world!MongoDB is committed to providing any necessary accommodations for individuals with disabilities within our application and interview process. To request an accommodation due to a disability, please inform your recruiter.MongoDB, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type and makes all hiring decisions without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
  "job_function": "Finance and Sales",
  "employment_type": "Full-time",
  "industries": "Information Technology and Services, Computer Software, and Internet"
 },
 {
  "job_id": "2613796909",
  "title": "Creative Content Writer",
  "company": "Lowcountry Land Trust",
  "place": "Charleston, SC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/creative-content-writer-at-lowcountry-land-trust-2613796909?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=Is8WLRz%2BkOs21P9Q%2FRvSjw%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Position: Creative Content WriterPosition Type: Full-timeReporting: Chief Advancement OfficerLocation: Charleston, SC (Remote from Home) Application Instructions:To apply, please email a cover letter and resume in one PDF to:Kate Durand, Communications Managerkdurand@lowcountrylandtrust.org POSITION SUMMARYLowcountry Land Trust (“LLT”) seeks a Creative Content Writer (“CCW”) who will perform basic communications tasks that the LLT Advancement Team needs to execute our editorial calendar and overall communications and fundraising strategy. The CCW is an individual who is highly skilled at developing dynamic and compelling narratives that inspire and engage audiences across various media. These stories will drive the content of our website, social media, printed materials, and grant proposals, and will embody the voice of the organization through the written word. Reporting to the Chief Advancement Officer, the CCW will compose content according to the editorial and fundraising calendars developed by the Communications Manager and Chief Advancement Officer, and is an integral member of the Advancement Team. This is an entry-level position, and we encourage applicants who are ready to learn and hone their skills. RESPONSIBILITIES Communications Writing:Serve as the in-house copywriter, assisting and collaborating to create content in adherence to LLT’s editorial calendar, overarching themes, branding, and strategy.Draft and post social media content on LLT’s established social channels with the opportunity to assist in expanding to new channels.Assist in the assembly of our monthly newsletter (writing/editing support where needed, uploading blog posts, building the email newsletter template). Assist in procuring content to build out new series/ programs as they are strategized.Create and/or collaborate on the development of written communications, including social media and blog posts, press releases, newsletters, fundraising appeals, and other marketing copy.Grant Coordination:Prepare proposals by determining concept, gathering and formatting information, writing drafts, and obtaining approvals.Meet proposal deadlines by establishing priorities and target dates for information gathering, writing, review, approval, and transmittal.Develops proposal by assembling information including project nature, objectives/outcomes/deliverables, implementation, methods, timetable, staffing, budget, standards of performance, and evaluation.Writes, revises, and edits drafts including executive summaries, conclusions, and organization credentials.Maintains quality results by using templates; following proposal-writing standards including readability, consistency, and tone; maintaining proposal support database (Raiser’s Edge).Updates job knowledge by participating in educational opportunities; maintaining personal networks. QUALIFICATIONSRequired:Bachelor’s degree in Communications, Marketing, Design, Journalism, Creative Writing, English, or a related field from an accredited institution of higher education. 0-4 years of experience (entry level).Must have excellent written and verbal communication skills.Excellent leadership, collaboration, time management, organizational, communication, and interpersonal skills.Proficiency in organizing and prioritizing tasks in a fast-paced environment.Demonstrated capacity to develop narratives based on prompts or concepts.Passion for conservation and the Lowcountry.Ability and confidence to learn and adapt.Preferred:Familiarity with G Suite and Microsoft Office.Experience with Canva, InDesign and Photoshop.Experience with content management systems.Familiarity with project management software (Monday.com) and donor database (Raiser’s Edge).Familiarity with video development and simple editing software.REMOTE WORK REQUIREMENTSPhone (mobile or landline)Reliable internet Printer (if needed)LLT will provide the following:Laptop, mouse, keyboard, monitor Desk and chair (if needed)Office supplies (paper, pens, organizers, stapler, etc.)BENEFITSInsuranceHealth Insurance - 100% Employer Paid for EmployeeDental Insurance – 100% Employer Paid for EmployeeLife Insurance ($10,000)Long Term DisabilityFinancial & Retirement403(b) – 5% Match and Fully VestedFamily & ParentingMaternity & Paternity LeaveRemote Work/Work from Home Day(s)Flexible HoursPaid Time OffUnlimited vacation and sick days11 Paid Holidays Flexible Summer Schedule Perks Dog Friendly WorkplaceMobile Phone Reimbursement ($20 per month)Health & Wellness Positive EnvironmentLowcountry Land Trust is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613778729",
  "title": "Administrative Assistant",
  "company": "Marriott Hotels",
  "place": "Los Angeles, CA",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/administrative-assistant-at-marriott-hotels-2613778729?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=GIVgv6BQkZ%2BpAaGnF9Knjw%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Posting Date Jun 21, 2021 Job Number 21063055 Job Category Administrative Location Los Angeles Airport Marriott, 5855 West Century Boulevard, Los Angeles, California, United States VIEW ON MAP Brand Marriott Hotels Resorts Schedule Full-Time Relocation? N Position Type Non-Management Located Remotely? N Marriott International portfolio of brands includes both JW Marriott and Marriott Hotels. Marriott Hotels, Marriott International’s flagship brand with more than 500 global locations, is advancing the art of hosting so that our guests can travel brilliantly. As a host with Marriott Hotels, you will help keep this promise by delivering premium choices, sophisticated style, and well-crafted details. With your skills and imagination, together we will innovate and reinvent the future of travel. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 80 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. It’s as simple as that. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy a true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can really pursue your passions in a luxury environment. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. POSITION SUMMARY Enter and retrieve information contained in computer databases using a keyboard, mouse, or trackball to update records, files, reservations, and answer inquiries from guests. Transmit information or documents using a computer, mail, or facsimile machine. Operate standard office equipment other than computers. Prepare letters, memos, and other documents using word processing, spreadsheet, database, or presentation software. Handle incoming and outgoing mail, including date stamping and distributing incoming mail. Create and maintain computer- and paper-based filing and organization systems for records, reports, documents, etc. Compile, copy, sort, and file records of office activities, business transactions, and other activities. Enter and locate work-related information using computers and/or point of sale systems. Follow all company policies and procedures, ensure uniform and personal appearance are clean and professional, maintain confidentiality of proprietary information, and protect company assets. Welcome and acknowledge all guests according to company standards, anticipate and address guests’ service needs, assist individuals with disabilities, and thank guests with genuine appreciation. Speak with others using clear and professional language, prepare and review written documents accurately and completely, and answer telephones using appropriate etiquette. Develop and maintain positive working relationships with others, support team to reach common goals, and listen and respond appropriately to the concerns of other employees. Move, lift, carry, push, pull, and place objects weighing less than or equal to 10 pounds without assistance. Perform other reasonable job duties as requested by Supervisors. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott International considers for employment qualified applicants with criminal histories consistent with applicable federal, state and local law.",
  "job_function": "Administrative, Other, and Customer Service",
  "employment_type": "Full-time",
  "industries": "Hospitality, Leisure, Travel & Tourism, and Food & Beverages"
 },
 {
  "job_id": "2613823905",
  "title": "Community Investing Analyst",
  "company": "Citi",
  "place": "New York, NY",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/community-investing-analyst-at-citi-2613823905?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=w5nrgNedwIJMvYQTVDGcJg%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job Id: 21318230The Community Investing Analyst will work across the function on projects that support strategic planning, economic opportunity flagship programming and amplifying Citi’s community investing efforts. The Analyst will also provide some senior leadership executive support. Citi’s Community Investing and Development team works to enhance Citi’s positive social impact through equity investing, innovative financial solutions, and strategic philanthropy. This dynamic role will provide the opportunity to gain broad insight into community investing efforts while helping to drive organizational priorities. The ideal candidate is able to prioritize and manage a range of both programmatic and operational projects.Key Responsibilities:Provide project management and reporting support for flagship initiatives and priority special projects such as Citi’s Action for Racial Equity commitment and Community Investing and Development strategic planningPlay a key role in the execution and tracking of process improvement and efficiency effortsSupport team integration and talent development efforts, including organization chart management, new team member on-boarding, and coordinating all-staff and leadership team meetings and agenda contentContribute to the creation and review of senior leadership presentations and communications projectsProvide calendar management and travel planning support to the Head of Community Investing and Development/Citi Foundation President as necessary, including preparing briefing packages and coordinating complex travel agendasProvide additional special projects support as necessaryQualifications:An interest in learning about and contributing to a corporate social impact functionComfort with taking on new assignments and learning new things Excellent project management and organizational skillsAbility to prioritize and manage projects in a fast-paced environmentCapacity to work independently, and as a self-starterExcellent interpersonal and communication skills (verbal and written)Extremely detail oriented, reliable, and professionalProficiency in Microsoft office suiteThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.-------------------------------------------------Job Family Group: Communications and External Relations-------------------------------------------------Job Family:Community Development------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency Posting",
  "job_function": "Business Development and Sales",
  "employment_type": "Full-time",
  "industries": "Banking, Financial Services, and Investment Banking"
 },
 {
  "job_id": "2613790283",
  "title": "Administrative Assistant",
  "company": "Robinson Franzman LLP",
  "place": "Atlanta, GA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/administrative-assistant-at-robinson-franzman-llp-2613790283?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=%2B0xWL0EWrnEMGFIkfO5beQ%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Robinson Franzman LLP (\"Robinson\") is a corporate and commercial real estate law firm dedicated to providing value-driven, creative, and effective results on behalf of its clients. With offices in Atlanta, Georgia, Robinson serves clients across the United States in the financial services, commercial real estate, investment management, private equity, and technology industries. Robinson is committed to providing the highest quality work product in the industry and immediate responsiveness to its client’s needs. Robinson is hiring for an Administrative Assistant to run a busy and fast-paced corporate law practice. The ideal candidate will exhibit high standards, excellent communication skills, and have an ability to take initiative, and prioritize daily tasks. A strong ability to take charge and meet tight deadlines will ensure your success in this multi-faceted role. ResponsibilitiesHandle and coordinate active calendarsSchedule and confirm meetingsEnsure file organization based on office protocolProvide ad hoc support around office as neededOpen. process, and handle incoming and outgoing mailQualificationsBachelor's degree or equivalent experienceStrong interpersonal, customer service and communication skillsAbility to multitaskProficient in Microsoft Office suite",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613819719",
  "title": "Personal Executive Assistant",
  "company": "TalentBridge",
  "place": "Charlotte, NC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/personal-executive-assistant-at-talentbridge-2613819719?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=cwU9MYcIklAqRdixuz9s2Q%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job DescriptionWe are currently recruiting for an experienced personal assistant to support a sucessful business executive in the South Charlotte area. This role will require dedication to supporting him in his personal and professional life as we as ensuring the maintance of his homes in mutiple US locations.EXECUTIVE ADMINISTRATION Review CEO emails inbox and prepare daily document for review with ability to prioritize and track responses. Calendar management, preparation time/materials to review in advance Electronic files management and meeting follow-ups recorded and monitored Regular meeting tracking of group memberships, advisory boards, investor reporting, etc Corporate monthly expense report and submit wire transfer requests to Accounting PARTNER RELATIONSHIPS Notes dictated or transcribed after each meeting and provided before next meeting Google search for any recent major news Maintain database with new business cards and emails TRAVEL/EVENT COORDINATION National and international elite trip planning and experience including private jet charters, airport greeter service when applicable, communication to travel guests, dinner reservations and overall preferences Travel Membership tracking, coordination and renewals (AA Airpass, United PassPlus, Exclusive Resorts, Cuvee, Client Centurion Membership, Jetcard program hours, etc) Organize private events at the home (live music, food, wait-staff if not available, drinks, prep, etc) PERSONAL ASSISTANCE Personal accounting paying bills for private residence, vendors, contractors Prepare QuickBooks spending tracker report quarterly and merge with CFO personal accounting Personal Credit Cards monitored for unusual activity and paid in full accordingly Venmo and Zelle payments to vendors Medical appointments, labs and prescriptions with appropriate timing Submit out of pocket medical expenses to insurance Florida residency car registrations and track dates out of North Carolina state Personal errands and online ordering of supplies as needed Home Management/Auto Maintenance All vehicle, pool, lawn, home maintenance, water plants, fresh flowers - schedule, negotiate when necessary, manage and be present in the home when needed Hands-on role in Charlotte residence for minor repairs, organizing, attention to detail, manage vendors, etc Regular auto maintenance, gas, charged, cleaning, track registrations, ability to drive stick shift a plus&plus; Schedule and manage house cleaning and handyman as needed. Stock kitchen prior to client arrival and anticipate needs Charlotte residence wine cellar inventory entry and tracking whenever new items come in or consumed. Requirements College Degree Valid Driver's License Computer knowledge with Outlook, Word and Excel 5&plus; years of Administrative Assistant experience supporting senior level executives. 24/7 availability via phone/text/email, dedicated office hours Mon-Fri 8:30am-5:30pm and flexible evenings and weekends when needed. Ability to be onsite his SouthPark office when he is in town and private residence as needed. Can work remotely when he is traveling and check packages at both his home and office minimally twice a week when he is away Strong ability to work independently with little supervision; anticipate needs, attention to detail, proactive and organized Must be trust-worthy managing personal finances and confidentiality",
  "job_function": "Administrative",
  "employment_type": "Full-time",
  "industries": "Construction, Staffing and Recruiting, and Financial Services"
 },
 {
  "job_id": "2613831565",
  "title": "Student / Intern",
  "company": "Oracle",
  "place": "California, United States",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/student-intern-at-oracle-2613831565?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=%2FP4nrIryZGfciLFUoFwwLQ%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Job DescriptionOracle has a unique opportunity for a current college student to do an 2021 summer internship with the North America Talent Advisory team! Our team is responsible for all professional recruiting across Oracle in North America. As an intern, you will be part of the sourcing team and working alongside the sourcing team to learn more about talent acqusition and HR. You will be given requsitions to source and aligned to businesses much like a regular sourcer, but don't worry - we will provide you with training, mentorship, guidance and support as you learn the ropes. Additionally, you will also have a strategic project that you will be working with during the summer along with presentations at the end of the summer. This is a 12 week internship and will be done remotely.Successful sourcers (recruiting research associates) at Oracle will be able to build strategies to identify and attract top talent, partner with clients and talent sourcers to ensure a positive candidate experience and have a deep understanding of the talent market and candidate profiles.Responsibilities Work with Talent Advisors, hiring managers, and other stakeholders to understand recruiting needs and candidate profiles. Create and execute sourcing strategies to identify quality candidates at scale. Focused on delivering a positive and transparent candidate experience. Understand the competitive ecosystem and talent profiles and be able to adjust and creatively source the talent for Oracle Detailed Description And Job RequirementsThe Research Associate is involved throughout the entire value chain of the search process, working in conjunction with recruiters throughout the kick-off, strategy, and execution of search engagements to bring each search to a successful completion.Identify high quality and potential candidates for senior level assignments. Partner and collaborate with executive recruiter. Build intellectual capital and keep up-to-date with key market trends and competitive intelligence. Assist other team members in research and candidate identification of relevant profiles. Support team members in mapping of competitors. Maintain and update internal database while understanding the importance of data integrity. Partner with team member to develop target company lists through market research. Utilize existing tools, resources and technologies to assist in identifying top talentRequired Qualifications Must be a current college student with a graduation date after August 2021 and before May 2023 (Junior or Senior) Must be attending college in the United States, pursuing a BA/BS or a graduate degree. Must be able to complete a 12 week internship Preferred Qualifications Pursuing an HR degree or certification Motivated by an intellectually stimulating recruitment environment with the desire to identify the best talent for Oracle. High self-motivation and the ability to work both autonomously and as part of a team. Excellent communication and organization skills. Intellectually curious and highly analytical individua 10.1.0This job code is utilized for the majority of our temporary hires. The individual is performing hourly job duties as defined under the Fair Labor Standards Act.If you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 105135 in the subject line of the email.About UsInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
  "job_function": "Education and Training",
  "employment_type": "Internship",
  "industries": "Information Technology and Services, Computer Software, and Financial Services"
 },
 {
  "job_id": "2613777555",
  "title": "Producer",
  "company": "2K",
  "place": "Austin, TX",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/producer-at-2k-2613777555?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=cVFZv0o0kVVBTs75CFO1dw%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Who We Are2K develops and publishes interactive entertainment globally for console systems, handheld gaming devices, and personal computers, including smartphones and tablets. 2K is a leading publisher of today’s most popular gaming genres and most well-known for critically acclaimed game franchises like NBA 2K, WWE 2K, Bioshock, Borderlands, Evolve, XCOM, and the beloved Sid Meier’s Civilization.What We NeedDevelop quality software products, from concept to release, and for helping to maintain the creative vision of the products for 2K Games. All candidates should be self-motivated, highly organized, and possess strong leadership and team-building skills. A Producer is a leader, capable of taking charge of a project, franchise, or external team and unifying the project or group effectively towards a specific set of goals. This role requires the simultaneous management of multiple products. The Producer is ultimately responsible and accountable for shipping products timely and to a high degree of quality whether as their direct responsibility or via their direct reports. Additionally, the Producer is encouraged to contribute to the growth of the Publishing Production group whether through improving group-wide processes or spearheading initiatives around training, or sharing their institutionalized knowledge.What You Will Do Manage and lead multiple projects or franchises simultaneously at different stages of development from concept to completion while acting as the product’s champion Oversee, lead and liaise with internal and external resources to meet production schedules and help maintain a coherent creative vision throughout the entire development life cycle Serve as a technical and business resource to other producers, assisting them in the resolution of complex problems or leading them on larger projects Support the strategic planning and budgeting processes for products, providing financial, technical, and creative input to management Work with Production Senior Management in improving development processes and standard methodologies Establish development priorities and deadlines Develop product budgets and schedules and maintain forecasts of the budget, anticipating, identifying, and resolving overruns Ensure adherence to schedules and budgets through enforcement of landmark approval or disapproval as per established contracts Assist Producers in the direction of large, strategic products Assist with recruiting and interviewing candidates for positions in product development Establish, maintain, and improve relationships with internal and external resources Manage and act to prevent potential conflicts between internal and external expectations for projects Assist and drive identifying the key product to acquire or license to support the company business goals Assist with coordinating game release process with internal groups across the company Travel, both domestic and international, is required Potential day-to-day direct management and mentorship of other publishing production staff including hiring, personnel reviews, etc Coordinate with industry-first parties (Nintendo, Sony, and Microsoft) seeing projects from concept through to gold master Coordinate with Marketing to ensure alignment between Product Development, Developer and Marketing Who We Think Will Be A Great Fit5:30 Bachelor's degree required 5-7+ years of experience in internal or external game development Experience shipping Steam titles and detailed knowledge of the Steam platform Experience with AAA products preferred Experience with games-as-a-service (GaaS) a plus Must demonstrate strong fiscal sense, in leading both budget and expectations both within the team and to executive management Excellent communication skills (verbal and written), time and project management skills Strong knowledge of Microsoft Excel, Word, PowerPoint and JIRA Demonstrated ability to lead and connect with all development subject areas Experience building and managing relationships with vendors and other external resources Experience with industry-first parties (Nintendo, Sony, and Microsoft) seeing projects from concept through to gold master Experience with scheduling tools a must Experience handling conflict Experience leading and crafting sophisticated budgets and personnel plans Experience managing, mitigating, and resolving risks Understanding of various production process and methodologies Expected to identify and then take ownership of any responsibilities that lie within the scope of project components being led and are not currently assigned Capable of handling multiple projects at a high level to provide a balanced perspective for team managers Strong focus on leadership of leaders; must be capable of attaining the highest quality results through managing project managers Ability to conduct themselves in a professional manner with all co-workers on all levels of the organization Must display resourcefulness, passion, and self-motivation Quick learner, able to pick up new tools and learn new processes quickly while pro-actively seeking out training as needed Flexibility to take on additional responsibilities, as assigned by senior management Strong problem-solving skills Adept at establishing relationships throughout the organization Excellent time leadership skills Ability to self-prioritize effectively, to ensure key items are delivered to meet immediate project needs Must be able to effectively communicate risks and obstacles both to managed team members, as well as to upper management Ability to supervise schedules of external teams without any loss ineffectiveness Ability to lead to and deliver on hard product deadlines with rapid development cycles while being the guardian over product quality Proven and established negotiation skills Strong industry understanding and knowledge (both historically and forward-looking) Skilled in all phases of game development from concept to completion Ability to encourage and empower those that work for them and those they workaround Confident public speaker, particularly able to handle press interviews, executive review meetings, etc. The ability to multi-task in order to handle a very large number of discrete tasks at once, without losing focus on any individual item Highly organized and self-directed, and capable of instilling that characteristic in others",
  "job_function": "Design, Art/Creative, and Information Technology",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Information Technology and Services, and Computer Software"
 },
 {
  "job_id": "2613826439",
  "title": "Food and Beverage Manager",
  "company": "Confidential",
  "place": "Miami Beach, FL",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/food-and-beverage-manager-at-confidential-2613826439?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=GHz4DGaGiCARSt%2BK%2Fz6D%2FQ%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "We are actively seeking a FT Food & Beverage Manager for a luxurious hotel in Miami, FL to create an exciting, innovative, and memorable dining experience for all guests and Lead a well-rounded and knowledgeable front-of-house team. Summary:Daily evaluation of restaurant service performance, coordination of timely food production.Participates in evaluation of food products, kitchen employee performance, and development of products consistent with our market position.Develop a selection and pricing strategy of all liquors and wines and supervision of their procurement.Assist the General Manager in building financial objectives on an annual basis through the budget process.Assist in meeting the financial targets in the sales area by executing and improving the annual marketing plan, reacting quickly to new opportunities, running consistently high operation standards, and effective utilization of marketing funds.Help meet the budget in all areas of cost control with a consistent focus on the cost of sales and payroll.Responsible for communicating with management, employee and accounting staff, identifying developed personnel and providing the necessary training as positions open.All personnel should receive regular, timely and honest evaluations of their performance through the quarterly Check-In.Implement and conduct ongoing training programs for new and existing management and employee staff.Responsibility for the daily cleanliness of the restaurant both internally and externally by coordinating kitchen cleanliness and service area maintenance with the GM and Chef.Supervises all non-supervisory service employees.Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws.Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and coaching employees; addressing complaints and resolving problems.Requirements:3-5 years of management experience in hospitality or similar industry.Bachelor's degree in Hospitality, Restaurant, or Culinary Management is preferred.Excellent interpersonal communication skills, problem-solving skills, and organizational ability.Passion for creating and personalizing guest experiences.Food Handler Certification (if applicable).Flexible schedule, able to work evenings, weekends, and holidays when needed.",
  "job_function": "",
  "employment_type": "Full-time",
  "industries": ""
 },
 {
  "job_id": "2613817628",
  "title": "Operations Associate",
  "company": "Bird",
  "place": "Santa Monica, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/operations-associate-at-bird-2613817628?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=%2BA%2BGTPxR%2B7M%2BSEmJUUbthA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Who Is BirdBird is a global team guided by a shared vision: to make cities more livable through safe, sustainable electric mobility. From our first e-scooter ride in 2017 to the thousands of rides taking place every day, our passionate team and award winning custom vehicles have helped riders complete hundreds of millions of carbon-free trips in more than 150 cities around the world. And we're just getting started.Bird’s Community Operations team facilitates operational excellence by providing customers world-class experiences, providing critical insights to cross-functional stakeholders, and driving strategic and new initiatives forward. The team stays focused on aligning the highest-level company priorities with effective day-to-day operations, and helping identify and evolve early market signs into future strategic initiatives.The team is seeking a highly-driven, team-oriented, and analytical associate with a bias toward action and impact. The role will oversee BPO sites’ operations covering multiple languages and countries. This role will ensure consistent delivery of key performance metrics related to production, quality (CSAT), and required service level agreements (SLAs). This is a highly cross-functional opportunity to work with city operations, product, systems and business analytics teams to strengthen standard operating procedures, ongoing training, schedules, and staffing.ResponsibilitiesBuild and implement operational processes that deliver scalable solutionsAnalyze key business drivers, trends, and operational metrics to inform improvement strategy and project designMonitoring vendor performance across relevant KPIs and conduct deep-dive investigations to understand the “why” behind how metrics are performingLeverage business tools such Zendesk and/or technical add-ons to identify and remove performance barriersEnsure BPO and contractor agent teams are executing operational strategies to assure compliance with SLAs across all supported lines of businessLead daily and weekly performance reviews and communication with BPO/Contractor teams Work with senior leadership to align staff schedules with defined strategiesWork with Business Analytics team to further create and define key performance indicators (KPI’s) and methodologies to improve and maintain customer experiencePresent analyses and lead discussion with cross-functional stakeholders to senior leadershipRequirementsBA/BS in Business or other related major or equivalent relevant work experience required3+ years experience outsourcing strategy and implementation. Ideally experience in managing and coaching BPO and contractor agent teamsStrong communication, organization and stakeholder management skillsExcel modeling skills and PowerPoint presentation skillsAble to work across cultures effectively, valuing diversity within a virtual teamWilling and eager to roll up sleeves and get to know the business detail-orientedPreferred QualificationDemonstrated ability to deliver results in a fast-paced environmentExperience in the media, digital and/or tech industriesExperience with Zendesk and SQLBilingual or Multilingual is a plusGrowth mindset: seek out learning opportunities for yourself and the teamCulture at BirdWe're an ambitious, smart and open-minded team that is passionate about our mission. Each day is unlike the last, as we’re constantly moving forward, challenging each other, and working together to create the future of micro-mobility.Perks upWe want people to succeed at Bird, so we give our teams plenty of time off to relax and recharge. We also offer a generous employer-paid healthcare coverage, on-demand doctor visits, childcare support, a pre-tax commuter account for mass transit or parking, a wellness stipend, and more.Bird is the worldBird stands for a culture of inclusion. We celebrate different backgrounds, experiences, and perspectives —encouraging everyone to bring their authentic selves to work. We have a diverse environment that empowers our team to feel comfortable when they voice their opinions. For these reasons and more Bird is a proud equal employment opportunity employer. We welcome everyone regardless of their race, color, religion, sex, national origin, age, disability, veteran status, or genetics, and we are dedicated to providing an inclusive, open, and diverse work environment.Sound like a place you’d like to work? Sweet. Let’s chat.",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Computer Software, Internet, and Financial Services"
 },
 {
  "job_id": "2613850781",
  "title": "Online Marketing Specialist",
  "company": "Wish",
  "place": "San Francisco, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/online-marketing-specialist-at-wish-2613850781?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=g92rubmuoqa%2FQRSoaOGhlA%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Company DescriptionWish is a mobile e-commerce platform that flips traditional shopping on its head. We connect hundreds of millions of people with the widest selection of delightful, surprising, and—most importantly—affordable products delivered directly to their doors. Each day on Wish, millions of customers in more than 160 countries around the world discover new products. For our over 1 million merchant partners, anyone with a good idea and a mobile phone can instantly tap into a global market.We're fueled by creating unique products and experiences that give people access to a new type of commerce, where all are welcome. If you’ve been searching for a supportive environment to chase your curiosity and use data to investigate the questions that matter most to you, this is the place.Job DescriptionManage daily guest list for influencers to come onsiteConduct outreach and curate relationships with new influencersTrack social media trends & proactive pitching of opportunitiesPrepare weekly social media performance reporting and recaps for internal useFollowing up with influencers to ensure content guidelines are metWorking proactively to think about the guest experience (and any potential watchouts), as we roll new experiences, partnerships, and offerings (Getting ahead of questions and issues).Creative fun events around social campaigns and surprise & delight moments for guests.Manage social media accounts (posting stories, recap of events, announcements, etc).QualificationsExperience managing social media campaigns that incorporate live eventsHands on experience managing Influencer marketing campaignsKeen focus on company objectives and deliverablesAbility to maintain objectivity and discretion at all times even when interacting with high profile individualsSignificant live event experience including but not limited to large scale party planning and small event managementAbove all else, candidates must operate on behalf of our client company at all times and NOT try to leverage the company’s branding efforts to build their own brand.Additional InformationWish values diversity and is committed to creating an inclusive work environment. We provide equal employment opportunity for all applicants and employees. We do not discriminate based on any legally-protected class or characteristic. Employment decisions are made based on qualifications, merit, and business needs. If you need assistance or accommodation due to a disability, please let your recruiter know. For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records.Individuals applying for positions at Wish, including California residents, can see our privacy policy here.",
  "job_function": "Marketing",
  "employment_type": "Full-time",
  "industries": "Computer Software, Internet, and Consumer Goods"
 },
 {
  "job_id": "2613754103",
  "title": "Finance Intern",
  "company": "ProducePay",
  "place": "Los Angeles, CA",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/finance-intern-at-producepay-2613754103?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=KuMznurxsD5xvzWMwroUuQ%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "ProducePay is a new tech-based cash flow solution that provides domestic and foreign fresh producefarmers (growers) who ship to the U.S. with immediate access to distribution and financing. ProducePay’ssolutions provide the working capital fresh-produce growers’ need to complete their harvest and grow.By leveraging our international network, ProducePay connects clients with interested fresh producebuyers and distributors. Interested distributors receive connection to a growing list of international farmersJob Descriptionwho might otherwise feel limited by current financing options. Assist with financial reports and client-related reports. Track contracts and assist with producing accurate and timely financial statements. Work with the engineering team on building out the platform. Other finance, Admin, and accounting tasks as needed. Processing and depositing check payments received, and perform document verification and credit exposure checks on a daily basis. Receiving, mailing, and handling legal documents. Requirements At least 3-month commitment (excellent candidates would be potentially promoted to full-time FinanceAnalyst) Extremely detail-oriented. Understanding of business and accounting concepts Advanced skills in Excel including pivot tables, macros, etc. Must be working towards (or have completed) a bachelor’s degree, preferably in Business, Economics, Mathematics or Accounting International students in STEM majors (3 years OPT) are accepted. Submit transcripts if graduated less than 2 years ago. Please include GPA on your resume. Benefits Medical and Life insurance (Covered 100% for Employee only) Dental and vision 401k – company contributes 3% (After 5 months of employment) Unlimited PTO $50 phone plans. 0.06% equity stock options Yearly bonus (eligibility varies) Work at the #1 ranked company in Los Angeles for best tech startup! Fully remote work through the end of COVID, 2 work from home days per week Friday Team Lunches Regular team outings (go-karting, paintball etc.) - Just ask for our team photos to see how much fun we’ve had ;)",
  "job_function": "Finance",
  "employment_type": "Contract",
  "industries": "Computer Software, Internet, and Financial Services"
 },
 {
  "job_id": "2613811850",
  "title": "Brand Director",
  "company": "Procter & Gamble",
  "place": "Cincinnati, OH",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/brand-director-at-procter-gamble-2613811850?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=IOv283GRbOtEXGZB90ezLg%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Did you know P&G invented the concept of branding and data-driven brand management?Over the past 180 years, P&G has served billions of Households every day with leadership brands like Tide, Pampers and Pantene while also leading the industry with iconic campaigns like “Like a Girl, “The Talk” “The Look” and “Widen the Screen”. Ranked consistently among the top in marketing, top in leadership and world’s largest advertiser, P&G is a place where your leadership, creativity and passion comes together to impact our business, our markets and our communities.We hire based on the potential we see in people, so here, you’ll be trusted to dive right in, take the lead, use your initiative, and build billion-dollar brands that help make everyday activities easier and make the world a better place. You’ll be doing meaningful work that takes your career places you never imagined. Join us, and you’ll be part of this effort from Day 1.From early on, you’ll be at the core of breakthrough innovations, be given exciting assignments, lead initiatives, and take ownership and responsibility. And you’ll do this in creative work spaces where new ideas flourish. All the while, you’ll receive world-class training to help you become a leader in your field. And it’s not just about what you’ll do, but how you’ll feel: welcomed, valued, purposeful, challenged, heard, and inspired.We Win With Consumers' Preferences In Each Of The Following AreasAs a Brand Director, you will be responsible for making sure that our brands win with consumers, retailers and in the market to grow sales, share and equity. When they learn about our product When they choose to buy the product When they use the product at homeWe are looking for the world's best brand builders who follow one simple concept: \"Consumer is boss\"Working in Brand Management at Procter & Gamble means you are a total business owner, maintaining a holistic leadership responsibility on brands. We need someone who is dedicated and who can guide the vision and strategy behind a brand(s) by developing marketing plans and driving innovation. Our Brand Leaders work regularly across multi-disciplinary partners to identify consumer, shopper, and customer insights and execute marketing tactics that will continue to grow your brand profitably.Together, we'll continue to create leading brand experiences and make a difference for nearly 5 billion consumers every single day.As a Brand Director, you will have opportunity to work on brands, driving the business results. You will lead multi-disciplinary teams (including Sales, Finance, Product Supply, Advertising, and Media Agencies) to collaborate and develop top winning strategies for your brand's success.You will lead a mix of Marketing and Brand Management projects enabling you to show the breadth and depth of your strategic and integrative thinking. As a Brand Leader you own taking insights from the data, to set the direction for brand growth.Responsibilities IncludeBrand equity developmentBusiness driver deliveryConsumer understandingData analyticsDeveloping partnershipsFinancial managementOpportunity identification & innovationCoaching and training the organizationQualificationsWe think you’d be a great fit for this role if you have:A college degree (Bachelor’s or Master’s is fine, preferably with some business focus)Excellent visionary, strategic, and courageous leadership skillsAt least five years of experience in the following areas:Brand equity development, strategy, and or planningCustomer/consumer marketing and or eCommerceDeveloping partnerships and communication strategyFinancial management (brand profit and lost and stewardship)Keep in mind:Pay is based on experience and capability.Positionis in Cincinnati, OH.All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, disability status, age, sexual orientation, gender identity and expression, marital status, citizenship, HIV/AIDS status or any other legally protected factor.Immigration sponsorship is not available for this role. As a general matter, Procter & Gamble does not sponsor candidates for nonimmigrant visas or permanent residency. However, Procter & Gamble may make exceptions on a discretionary basis. Any exceptions would be based on the Company's specific business needs at the time and place of recruitment as well as the qualifications of the individual.Procter & Gamble participates in e-verify as required by law.Qualified individuals will not be disadvantaged based on being unemployed.What We Offer YouResponsibilities from Day 1 – You will start off working on key brands from the beginning. Over time, as you expand your impact on the business, your responsibility and ownership of a brand will quickly grow.Recognized state of the art marketing skills – We will constantly help you improve your marketing knowledge and management abilities.Continuous coaching & mentorship– We are passionate about our work. We will make sure you receive both formal training and regular mentorship from your manager and others.Dynamic and respectful work environment – We live our Purpose, Values, and Principles daily. We value every individual and encourage initiatives promoting agility and work/life balance.",
  "job_function": "Marketing and Sales",
  "employment_type": "Full-time",
  "industries": "Consumer Goods"
 },
 {
  "job_id": "2613815601",
  "title": "Vice President, Program Management",
  "company": "Univision Communications Inc.",
  "place": "Miami-Fort Lauderdale Area",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/vice-president-program-management-at-univision-communications-inc-2613815601?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=G8hkMWfE1C1D%2FnhuNn1CUQ%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Position SummaryUnivision Communications, Inc is seeking a Vice President, Program Management with experience in managing complex programs and projects in large scale consumer services to ultimately drive digital experiences that empower and entertain the Hispanic community.Job ResponsibilitiesThe mission of the Vice President, Program Management at Univision will be to establish, maintain and drive an agile practice which enables high quality, predictable and efficient project management and delivery for our video streaming offerings on web, mobile apps and connected devices.You will establish visibility, tracking, milestones for major integrations which contribute to the overall streaming effort. This includes aspects of various technology partner integrations and other internal assets that will be integrated.You will work cross functionally to drive company goals, be relentless about the details, and be ready to present to executive leadership on status, at a moment’s notice. Fluency in the schedule will be paramount.You will lead with confidence, conviction, diligence and by example.This role reports directly to the EVP Product and Engineering for Univision.Desired Skills& Experience15+ years’ experience driving programs and process at digital companies.You are obsessed with the milestones and the details that fuel them.You are a proven program leader, with strong opinions and conviction on process.You are fearless in taking on issues, challenges and people, striving for the best outcome for the business.You have a reputation for attracting and recruiting top talent.You have a demonstrable track record of leading organizations through growth inflections and transformations.You have a hands-on approach to program management, process, ceremonies and roadmaps.You have the presence and experience necessary to influence and partner with senior level audiences and comfort with Boards and C-level executives.You possess unquestionable integrity, credibility, and character.Eligibility RequirementsMust be willing to work from offices in either Miami, FL; New York, NY; or Los Angeles, CA.Employment/education will be verified.Applicants must be currently authorized to work in the United States on a full-time basis.Univision is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.",
  "job_function": "Project Management and Information Technology",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Information Technology and Services, and Online Media"
 },
 {
  "job_id": "2613869939",
  "title": "Customer Success Manager",
  "company": "Carrot Fertility",
  "place": "United States",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/customer-success-manager-at-carrot-fertility-2613869939?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=ak1o4lEkrt6LQv1eUfN1pA%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "About CarrotCarrot Fertility is the leading global fertility benefits provider for employers built to make fertility care and family-forming affordable and accessible for everyone who wants or needs it. Companies use Carrot to customize a fertility benefit that provides employees financial, medical, and emotional support as they pursue parenthood, reducing healthcare costs and resulting in better clinical outcomes.The RoleCarrot is seeking a Customer Success Manager to support Carrot’s existing customers aligned with the small business segment to drive retention, increase member engagement, and maintain high levels of customer satisfaction. The Customer Success Manager acts as a trusted advisor to HR benefits leaders, helps communicate the value of the Carrot product, and responds to customer needs, questions and requests.The TeamThe small business segment is a pooled business model to support customers. The role reports to the Customer Success Team lead.Minimum QualificationsBachelor’s degree2-3 years of experience in customer success, customer support, or account management in a high-growth, technology environmentEnthusiasm for Carrot Fertility’s mission and eagerness to become a part of our collaborative, friendly, and dynamic teamPreferred QualificationsExperience with Salesforce or other CRM Some familiarity with Carrot’s buyers (HR benefits leaders) is preferred, but not requiredDetail-oriented with strong analytical, writing, and communication skillsComfortable working in an ambiguous environment; organized, diligent, and self-motivatedProcess-oriented with an automation/efficiency mindset; experience developing best practices, creating scalable systems and automating routine processesAbility to adopt a continuous improvement mindset and actively contribute to the processes and procedures of the Customer Success teamWhy Carrot?Founded in 2016, CB Insights recognized Carrot as one of the world's most promising private digital health companies. In 2020, Carrot was named to Fast Company’s World Changing Ideas awards program, which recognizes companies that are tackling society's biggest problems, and Carrot was named to Fierce Healthcare’s Fierce 15 List of 2021 which recognizes the most promising healthcare companies in the industry. Carrot supports 200 companies in more than 50 countries across North America, Asia, Europe, South America, and the Middle East",
  "job_function": "Customer Service and Information Technology",
  "employment_type": "Full-time",
  "industries": "Internet, Financial Services, and Hospital & Health Care"
 },
 {
  "job_id": "2613811157",
  "title": "Operations Specialist",
  "company": "Waste Management",
  "place": "Morrisville, NC",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/operations-specialist-at-waste-management-2613811157?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=5um34SvbVXnbaljAuINkcQ%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "Pay Range- $16.00 - $18.00 per hour based on relevant experience Work Schedule- 8am-5pm M-F What is the Value of a WM Job? The value of a WM job is more than a paycheck. We are Committed to your Growth : 100% tuition paid for you and your family We are People First : We foster an environment where all teammates feel welcomed, valued and seen We are Stable: Our employees are home every day and perform essential and meaningful work We are Investing in You: Amazing Medical, Dental & Vision, 401k with match, Discounted Stock options, Dependent Day Care, and more! #WeAreWM #WMCareers Equal Opportunity Employer: Minority/Female/Disability/VeteranWaste Management (WM), a Fortune 250 company, is the leading provider of comprehensive waste and environmental services in North America. We are strongly committed to a foundation of operating excellence, professionalism and financial strength. WM serves nearly 25 million customers in residential, commercial, industrial and municipal markets throughout North America through a network of collection operations, transfer stations, landfills, recycling facilities and waste-based energy production projects.I. Job SummaryProvides clerical and administrative support to departmental Managers, and assists in coordinating all aspects of daily operations, including recording and reporting data.II. Essential Duties And ResponsibilitiesTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Other minor duties may be assigned. Assists in troubleshooting and resolving safety, service, and operational issues. Creates, distributes, and closes-out customer tickets on a daily basis. Maintains and distributes department related information on a daily basis. Communicates with other supervisors and managers about operations and/or dispatch issues. Completes and maintains a variety of reports as directed by the department manager. Uses software tools to manage a variety of tasks, such as procurement, time and attendance, safety incidents, and contract labor. Assists with data collection and reporting required for incentive pay programs. Assists with the processing of payments and other financial tasks as necessary. Assists in the implementation of operational projects as needed. Communicates with customers about service issues as needed. Communicates with employees about scheduling and work assignments as needed. May enter and maintain Service Machine SMART data on a daily basis. Performs other duties as assigned. III. Supervisory ResponsibilitiesThis job has no supervisory duties.IV. QualificationsThe requirements listed below are representative of the qualifications necessary to perform the job. Education and Experience Education: High school diploma or G.E.D (accredited) Experience: Zero (0) to four (4) years previous experience (in addition to education requirements) Certificates, Licenses, Registrations or Other Requirements None required. Other Knowledge, Skills or Abilities Required None required. BenefitsAt Waste Management, each eligible employee receives a competitive total compensation package including Medical, Dental, Vision, Life Insurance and Short Term Disability. As well as a Stock Purchase Plan, Company match on 401K, and more! Our employees also receive Paid Vacation, Holidays, and Personal Days. Please note that benefits may vary by site.If this sounds like the opportunity that you have been looking for, please click \"Apply.”Primary LocationUnited States-North Carolina-MorrisvilleFlexible Work Location AcceptableNoShiftDayTravelNoFLSA StatusNon-exemptJobOperations",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Construction, Staffing and Recruiting, and Transportation/Trucking/Railroad"
 },
 {
  "job_id": "2613789827",
  "title": "Operations Assistant",
  "company": "CCS Fundraising",
  "place": "Chicago, IL",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/operations-assistant-at-ccs-fundraising-2613789827?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=8lhCV%2Be1NaPHN3uRJZd8LQ%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "About CCS: CCS Fundraising is an international strategic fundraising firm that partners with nonprofits for transformational change. For seven decades, CCS has empowered many of the world’s greatest organizations across sectors to advance some of the most important causes in history. We plan, manage, and implement programs and initiatives that achieve fundraising goals and mission impact. CCS provides tailored support to more than 400 nonprofit organizations annually. Headquartered in New York, the firm has over 250 professionals and more than a dozen offices throughout the United States and Europe. Our people are our greatest strength. At CCS, you will join a diverse team of smart, passionate, and resourceful professionals who are driven by purpose and committed to performance.Job Purpose: CCS Fundraising is seeking a self-motivated, reliable, and detail-oriented Operations Assistant to help support our Central United States leadership team. The Operations Assistant will lead in all scheduling, coordinate travel, process expenses, manage vendor relationships, and offer additional support to the operations team. The ideal candidate is highly resourceful, detail-oriented, professional, and capable of managing a heavy workload and prioritizing tasks in a fast-paced, deadline-driven corporate environment. This is an excellent opportunity to build a career in a mission-driven, growing company with competitive compensation and benefits.ResponsibilitiesManage day-to-day operations of the office, including taking calls, interfacing with clients and CCS personnel, responding to emails and managing office security accessProvide scheduling, travel, and expense processing support to the executive team; areas of focus include:Interfacing with internal and external audiences to schedule meetings and callsManaging the complex calendars of executive team membersMaking travel and hotel reservations; including tracking airline credits and rewards programsPreparing timely expense reports and cash reimbursement requestsParticipating in weekly operations meetings to provide insight on schedules and support the facilitation of next stepsUpload and track key documents and information in company-wide databasesDevelop and sustain a level of professionalism, among staff and clientele, consistent with the firm’s mission and valuesAdditional duties as assignedQualificationsPrior experience providing executive support as an assistant, executive assistant, office manager, or in business development or similarly focused positionProficient in Microsoft Office, with the ability to become familiar with firm-wide specific programs and softwareHigh attention to detailStrong organizational, project management, and problem-solving skillsImpeccable multi-tasking abilitiesSelf-starter able to drive activity in a fast-paced environmentFriendly and professional demeanorExperience with Concur preferredCCS offers a competitive benefits package and is an Equal Opportunity Employer.",
  "job_function": "Management and Manufacturing",
  "employment_type": "Full-time",
  "industries": "Marketing and Advertising, Nonprofit Organization Management, and Management Consulting"
 },
 {
  "job_id": "2613776909",
  "title": "Videographer",
  "company": "Swervnation",
  "place": "Greater Chicago Area",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/videographer-at-swervnation-2613776909?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=yPXhI%2Bu3DlAXXg%2FRWnBAFA%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "I need music videos every week and photos shoot please have location",
  "job_function": "",
  "employment_type": "Contract",
  "industries": ""
 },
 {
  "job_id": "2613765254",
  "title": "Coordinador",
  "company": "Fairmont Hotels & Resorts",
  "place": "Boston, MA",
  "date": "",
  "link": "https://www.linkedin.com/jobs/view/coordinador-at-fairmont-hotels-resorts-2613765254?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=IKcwzJsEp4qUAI4IoVo%2BAA%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "CoordinadorUsted es un multi-tasker y puede trabajar de forma independiente, realizando una amplia gama de tareas administrativas complejas y confidenciales para respaldar a su equipo. Se comunica bien con todos los contactos, anticipa y resuelve problemas y actualiza en equipo sus diversos proyectos..Lo Que Hay Para Usted En 3-4 puntos, muestre los beneficios y ventajas de trabajar en el hotelTarjeta de Beneficios para colaboradores que ofrece tarifas con descuento en Accor en todo el mundoProgramas de aprendizaje a través de nuestras AcademiasOportunidad para desarrollar su talento y crecer dentro de su hotel y en todo el mundo!Capacidad para hacer diferencia en la comunidad local a través de nuestras actividades de Responsabilidad Social Corporativa, como Planet 21Lo Que HaráOrganice e implemente los sistemas y procedimientos administrativos, y realice las tareas de soporte técnico necesariasSirva como una fuente principal de información para el equipoPrepare y mantenga los registros de su departamentoSu Experiencia y Habilidades IncluyenExcelentes habilidades interpersonales y de comunicaciónCapacidad para priorizar el trabajo en un entorno con múltiples interesesCapacidad para manejar información compleja y confidencial n con discreciónCompetencia con una variedad de programas informáticosSu Equipo y Ambiente De TrabajoEn 1-2 oraciones, comente el ambiente del equipo, del hotel o de la oficina de una manera que refleje la culturaNota: esta descripción podrá sufrir alteraciones incluyendo situaciones locales, de legislación y documentaciones oficiales de trabajoNuestro Compromiso Con La Diversidad & InclusiónSomos una empresa inclusiva y nuestra ambición es atraer, reclutar y promover talentos diversos.¿Por qué trabajar para Accor?Somos mucho más que un líder mundial. Te damos la bienvenida tal como eres y puedes encontrar un trabajo una marca que coincida con tu personalidad.Te apoyamos para que crezcas y aprendas cada día, asegurándonos de que el trabajo le dé propósito a tu vida, para que durante tu viaje con nosotros, puedas seguir exporando las posibilidades ilimitadas de Accor.Al unirte a Accor, cada capítulo de tu historia es suyo para escribir y juntos podemos imaginar la hospitallidad del mañana. Descubre la vida que te espera en Accor, visita https://careers.accor.com/¡Haz lo que amas, cuida el mundo, atrévete a desafiar el status quo! #BELIMITLESS21009879",
  "job_function": "Other",
  "employment_type": "Full-time",
  "industries": "Restaurants, Leisure, Travel & Tourism, and Hospitality"
 },
 {
  "job_id": "2613817496",
  "title": "Communications Specialist – Department of Public Health and Environment",
  "company": "City and County of Denver",
  "place": "Denver, CO",
  "date": "2021-06-23",
  "link": "https://www.linkedin.com/jobs/view/communications-specialist-%E2%80%93-department-of-public-health-and-environment-at-city-and-county-of-denver-2613817496?refId=IiVplYcNviqlY%2BUJ2CmhbA%3D%3D&trackingId=18OuTrWBs%2BrIFrXj6ZfMPg%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
  "description": "About Our JobWe encourage you to apply as soon as possible because this posting may close without advanced notice.Denver's Department of Public Health and Environment (DDPHE) is dedicated to advancing Denver's environmental and public health goals. DDPHE works collaboratively with city, state and community partners to conduct education, community engagement, and enforcement to promote healthy people, healthy pets, and a sustainable environment. DDPHE oversees a number of services related to public health and the environment and is comprised of six divisions: the Division of Administration; Community & Behavioral Health; Public Health Investigations; Denver Animal Protection; the Office of Medical Examiner; and Environmental Quality. For more information on DDPHE’s programs and services, visit the DDPHE website at: Denver Department of Public Health and Environment .The Division of Administration (ADMIN) provides overall policy direction, management, communications, and core services for the Department of Environmental Health. The Office manages departmental purchasing and budget, performance management, and community outreach and engagement. ADMIN also manages the City’s contract with Denver Health for a number of public health and administrative services provided between the two organizations.The Division of Administration has an opening for a Communications Specialist. In our Communications Specialist we are looking for a team player and strategic communicator. This position will work directly with DDPHE divisions to develop strategic communication plans, develop key messaging, update social media and communicate with stakeholders. This position will also handle day-to-day media relations including researching issues, interviewing and preparing subject matter experts as well as crisis communications. The Communications Specialist will report to the Director of Communications and Marketing and will be a vital part of the Communications team, effectively communicating news from all divisions to the appropriate audiences and helping to elevate the brand of DDPHE.Job Dutiesand responsibilities of this position include, but are not limited to, the following:Collaborate with DDPHE staff to produce a variety of communication pieces (press releases, speeches and message points, reports, presentations, fact sheets, etc.), digital content and/or develop strategies for enhanced PR with target audiences and distribute that information to internal and external audiences through a variety of communication channelsDevelop and implement communication strategies for social media and other digital assets; monitor and respond to social media on a daily basisOversee the preparation and distribution of responses to media requests, informational interviews, public inquires via email, letters or social media and/or public official requests, and ensures accuracy and timelinessPitch stories to media locally and nationally and build relationships with key reportersAct as spokesperson and represent DDPHE by relaying information and promoting publicity for public and media related initiativesDevelop, coordinate, and implement special events Effectively coordinate the development, design, approval, production, and distribution of marketing materials in partnership with internal and external design vendors/communications teams Along with all department staff, this position will actively participate on an emergency preparedness and response team to support DDPHE’s responsibilities outlined in the City’s Emergency Operations Plan. This may require being ‘on-call’ from time to time to help respond to emergencies. Additional training commensurate with assigned duties will be provided.Other duties as assignedAbout YouOur Ideal Candidate Will HaveExperience writing a variety of communication pieces including press releases, web content andprofessional reportsProven track record of generating earned media and acting as an organizational spokespersonExperience developing successful social media campaigns in a professional settingDemonstrated ability developing marketing plans and campaignsExperience working in government, public health or heath care organizationsQualificationsWe realize your time is valuable so please do not apply if you do not have at least the following required minimum qualificationsEducation requirement: Bachelor's Degree in Business Administration, Marketing, Communications or a related field.Experience Requirement: Three (3) years of full performance, professional level experience performing marketing and/or public relations functions including research and analysis, developing public announcements and publications, and developing marketing and/or public relations strategies.Education/Experience Equivalency: One (1) year of the appropriate type and level of experience may be substituted for each required year of post-high school education.Additional appropriate education may be substituted for the minimum experience requirements.License/Certifications: None.To Be Considered For This Position, You Must Include The Following On Your Job Application (upload The Attachment(s) To The Resume/CV Section On The My Experience Tab)ResumeCover letterAbout Everything ElseJob ProfileCA2840 Marketing and Communications SpecialistTo view the full job profile including position specifications, physical demands, and probationary period, click here .PositionTypeUnlimitedPositionSalary Range$77,174.00 - $127,337.00Starting Pay$77,174 - $84,000 per yearAgencyDept of Public Health & Environment The City and County of Denver provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, national origin, disability, genetic information, age, or any other status protected under federal, state, and/or local law. For information about right to work, click here for English or here for Spanish.",
  "job_function": "Marketing, Public Relations, and Writing/Editing",
  "employment_type": "Full-time",
  "industries": "Construction, Nonprofit Organization Management, and Government Administration"
 }
]